[
  {
    "store": "004",
    "failed_criteria": [
      "All sign letters are intact (none missing or broken).",
      "Photo framing: the entire sign face is clearly visible and centered."
    ],
    "action_plan": [
      "Ensure all letters are intact and visible; adjust lighting or exposure to avoid glare that obscures letters.",
      "Retake photo ensuring sign is fully visible, centered in frame, and not overexposed."
    ],
    "visual_feedback": [
      "The right portion of the sign (LOANS) is overexposed, obscuring letters.",
      "The sign is not centered and overexposure on the right obscures full visibility."
    ],
    "notes": ""
  },
  {
    "store": "013",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Resubmit photo with exterior signage illuminated: ensure bulbs or back-lighting are turned on and visibly glowing in the image."
    ],
    "visual_feedback": [
      "No visible glow or back-lighting on the sign; appears unlit and relying on ambient daylight."
    ],
    "notes": ""
  },
  {
    "store": "014",
    "failed_criteria": [
      "All sign letters are intact (none missing or broken)"
    ],
    "action_plan": [
      "Retake photo ensuring sign illumination is not overexposed so all letters are clearly visible."
    ],
    "visual_feedback": [
      "Lower panel of sign is overexposed, making letters unreadable."
    ],
    "notes": "Lower sign panel is overexposed, making letters unreadable. ACTION: Escalate for human review due to low confidence."
  },
  {
    "store": "020",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Turn on sign bulbs or backlighting so the light source is visibly glowing, then retake the photo ensuring the illumination is clearly shown."
    ],
    "visual_feedback": [
      "No visible glow from sign bulbs or backlighting; the sign appears unlit in the submitted image."
    ],
    "notes": ""
  },
  {
    "store": "039",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Ensure all exterior signage is illuminated during photo capture by choosing a time when lights are on (e.g., nighttime) or by verifying back-lighting is active."
    ],
    "visual_feedback": [
      "Pylon sign panels in daylight photos (timestamps 2025/05/29 12:46:29 and 2025/05/29 12:46:59) show no visible back-lighting; panels appear unlit."
    ],
    "notes": ""
  },
  {
    "store": "041",
    "failed_criteria": [
      "Exterior signage is fully illuminated: Confirm that sign bulbs or back-lighting are actually turned on"
    ],
    "action_plan": [
      "Turn on sign illumination so bulbs or back-lighting are clearly glowing; retake the photo when the sign is lit."
    ],
    "visual_feedback": [
      "No visible glow from the sign bulbs or back-lighting; sign appears unlit."
    ],
    "notes": ""
  },
  {
    "store": "050",
    "failed_criteria": [
      "Photo framing: the entire sign face is clearly visible and centered"
    ],
    "action_plan": [
      "Retake photo for A2: Store Signage & Lighting ensuring the full sign face is visible and centered in the frame."
    ],
    "visual_feedback": [
      "Right side of the sign face is cut off and overexposed, and the sign is not centered."
    ],
    "notes": ""
  },
  {
    "store": "052",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Ensure sign bulbs or back-lighting are turned on and glowing before taking the photo"
    ],
    "visual_feedback": [
      "No visible glowing light source on the sign; appears off relying on natural light"
    ],
    "notes": ""
  },
  {
    "store": "058",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Ensure sign lighting is turned on so that bulbs or back-lighting are visibly glowing when the photo is taken."
    ],
    "visual_feedback": [
      "Sign face shows no visible glowing bulbs or back-lighting indicating illumination."
    ],
    "notes": ""
  },
  {
    "store": "064",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Ensure store signage's bulbs or back-lighting are turned on during photo capture so the illumination is clearly visible."
    ],
    "visual_feedback": [
      "No glowing light visible behind the sign panels; sign appears unlit despite daylight conditions."
    ],
    "notes": ""
  },
  {
    "store": "066",
    "failed_criteria": [
      "Photo framing: the entire sign face is clearly visible and centered."
    ],
    "action_plan": [
      "Retake photo ensuring that the store sign face is fully visible and centered within the frame."
    ],
    "visual_feedback": [
      "Store sign appears off-center in the top-right portion of the image."
    ],
    "notes": ""
  },
  {
    "store": "070",
    "failed_criteria": [
      "Exterior signage is fully illuminated",
      "Sign is clean and free of dirt or stains"
    ],
    "action_plan": [
      "Ensure sign bulbs or back-lighting are turned on when photographing the exterior signage.",
      "Clean the sign face to remove all dirt and stains prior to capture."
    ],
    "visual_feedback": [
      "No visible back-lighting glow on the sign; appears unlit and reliant on daylight.",
      "Noticeable dirt and staining on the yellow panel above the storefront signage."
    ],
    "notes": ""
  },
  {
    "store": "088",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Ensure sign bulbs or back-lighting are turned on when taking the photo so that the sign face shows visible illumination."
    ],
    "visual_feedback": [
      "Submission photo taken during daylight shows no visible glow from the sign’s back-lighting; the sign appears unlit."
    ],
    "notes": ""
  },
  {
    "store": "092",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Resubmit photo taken at night with signage lighting turned on so that bulbs or backlighting are visibly glowing."
    ],
    "visual_feedback": [
      "Sign face is clearly visible but no illumination glow detected on the exterior signage; appears unlit."
    ],
    "notes": ""
  },
  {
    "store": "096",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Turn on the exterior sign's bulbs or back-lighting and retake the photo under conditions where the illumination is visible (e.g., at dusk or night)."
    ],
    "visual_feedback": [
      "No visible glow from the sign's bulbs or back-lighting; the sign face appears unlit in the submission photo."
    ],
    "notes": ""
  },
  {
    "store": "097",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Ensure the sign’s lighting is turned on so that bulbs or back-lighting are visible; retake the photo at night or at dusk with the sign illuminated."
    ],
    "visual_feedback": [
      "No visible glow from sign bulbs or back-lighting; signage appears unlit under daylight conditions."
    ],
    "notes": ""
  },
  {
    "store": "098",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Ensure all sign bulbs/back-lighting are turned on, including the Western Union section, and retake photo after illumination is confirmed."
    ],
    "visual_feedback": [
      "Western Union panel on the right side of the sign is not illuminated."
    ],
    "notes": ""
  },
  {
    "store": "102",
    "failed_criteria": [
      "Exterior signage is not fully illuminated"
    ],
    "action_plan": [
      "Turn on the sign’s lighting so that back-lighting or bulbs are glowing, then retake the photo ensuring the illumination is visible."
    ],
    "visual_feedback": [
      "The rectangular facade sign above the entrance appears unlit; no glow from back-lighting is visible."
    ],
    "notes": ""
  },
  {
    "store": "106",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Ensure sign lighting is turned on during photo capture so the bulbs or back-lighting are visibly glowing."
    ],
    "visual_feedback": [
      "No visible glowing light source detected in the sign panels."
    ],
    "notes": ""
  },
  {
    "store": "107",
    "failed_criteria": [
      "Exterior signage is fully illuminated",
      "Photo framing: the entire sign face is clearly visible and centered"
    ],
    "action_plan": [
      "Ensure sign bulbs or back-lighting are turned on for the exterior signage, not relying solely on external floodlights.",
      "Retake photo with the sign face centered and fully visible."
    ],
    "visual_feedback": [
      "No internal or back-lighting glowing from sign panels is visible; sign is only lit by external floodlights.",
      "Sign face is positioned to the left of the frame rather than centered."
    ],
    "notes": ""
  },
  {
    "store": "109",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Turn on sign bulbs/back-lighting before taking the photo to ensure the light source is visibly glowing."
    ],
    "visual_feedback": [
      "No visible glow from the sign’s bulbs or back-lighting, indicating the sign is not illuminated."
    ],
    "notes": ""
  }
]