[
  {
    "store": "001",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Ensure the exterior sign’s bulbs or back-lighting are turned on and visibly glowing; retake photo at night or activate lighting."
    ],
    "visual_feedback": [
      "Top facade sign appears unlit and relies on ambient daylight rather than internal illumination."
    ],
    "notes": ""
  },
  {
    "store": "002",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Ensure exterior signage bulbs or back-lighting are turned on so the sign is visibly illuminated."
    ],
    "visual_feedback": [
      "No visible illumination: main storefront sign letters appear unlit without any glowing back-lighting."
    ],
    "notes": ""
  },
  {
    "store": "004",
    "failed_criteria": [
      "All sign letters are intact (none missing or broken)",
      "Sign is clean and free of dirt or stains"
    ],
    "action_plan": [
      "Retake the photo with reduced glare and proper exposure to clearly show that all letters are present and undamaged.",
      "Clean the sign face to remove any dirt or stains, then resubmit a clear, well-lit image to confirm cleanliness."
    ],
    "visual_feedback": [
      "Overexposed glare on the right side of the sign obscures visibility of letters, preventing verification of intact lettering.",
      "Bright reflection on the sign surface hides any potential dirt or stains, making cleanliness unconfirmable."
    ],
    "notes": "Glare and overexposure prevent assessment of letter integrity and cleanliness. ACTION: Escalate for human review due to low confidence."
  },
  {
    "store": "012",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Ensure the sign’s internal illumination (back-lighting or bulbs) is turned on and glowing before retaking the photo."
    ],
    "visual_feedback": [
      "The main 'CASH4YOU' and 'LOANS & Financial Services' sign appears unlit, showing only daylight contrast rather than glowing illumination."
    ],
    "notes": ""
  },
  {
    "store": "017",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Retake photo during evening or low-light conditions when the sign’s bulbs/back-lighting are turned on so the illumination source is visible."
    ],
    "visual_feedback": [
      "Daytime submission photos (2025/05/16 16:36:04 & 2025/05/16 16:35:51) show the sign without any visible back-lighting or glowing bulbs."
    ],
    "notes": ""
  },
  {
    "store": "019",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Ensure sign bulbs or back-lighting are turned on and visibly glowing when capturing the photo"
    ],
    "visual_feedback": [
      "Top store signage shows no visible light source glow and appears unlit, relying on daylight contrast"
    ],
    "notes": ""
  },
  {
    "store": "020",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Turn on sign bulbs or back-lighting so the sign source is visibly glowing, then retake the photo."
    ],
    "visual_feedback": [
      "The Cash4You sign panel appears unlit with no visible back-lighting."
    ],
    "notes": ""
  },
  {
    "store": "021",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Resubmit photo with the exterior signage lighting turned on and glowing (bulbs/back-lighting visible)."
    ],
    "visual_feedback": [
      "No visible illumination on the sign; appears lit only by natural daylight without any glowing bulbs or back-lighting."
    ],
    "notes": ""
  },
  {
    "store": "022",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Ensure the exterior signage lighting is turned on with visible glowing light sources; if back-lighting bulbs are burned out, replace them before retaking the photo."
    ],
    "visual_feedback": [
      "No visible back-lighting glow on the exterior sign; appears only daylight illumination."
    ],
    "notes": ""
  },
  {
    "store": "026",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Turn on and capture the sign’s lighting in the photo so that the light source (bulbs or back-lighting) is visibly glowing."
    ],
    "visual_feedback": [
      "Sign appears unlit in daylight; no visible glow from bulbs/back-lighting."
    ],
    "notes": ""
  },
  {
    "store": "033",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Ensure sign bulbs or back-lighting are turned on so the light source is visibly glowing during photo capture."
    ],
    "visual_feedback": [
      "No visible glow from bulbs or back-lighting; sign appears lit only by daylight."
    ],
    "notes": ""
  },
  {
    "store": "039",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Turn on the sign illumination and retake the photo during its nighttime operation to show the bulbs or back-lighting glowing."
    ],
    "visual_feedback": [
      "The sign face is visible but shows no glowing bulbs or back-lighting; it appears unlit under natural daylight."
    ],
    "notes": ""
  },
  {
    "store": "047",
    "failed_criteria": [
      "Sign is clean and free of dirt or stains."
    ],
    "action_plan": [
      "Clean the exterior signage to remove dirt or stains; retake photo ensuring the sign face is clean and free of any marks."
    ],
    "visual_feedback": [
      "Dark stains visible on the upper right section of the sign face near the Western Union panel."
    ],
    "notes": ""
  },
  {
    "store": "050",
    "failed_criteria": [
      "Photo framing: the entire sign face is clearly visible and centered"
    ],
    "action_plan": [
      "Retake photo ensuring the entire sign face is fully visible and centered within the frame."
    ],
    "visual_feedback": [
      "Right side of the sign is cut off and the sign is not centered in the image."
    ],
    "notes": ""
  },
  {
    "store": "052",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Ensure sign bulbs or back-lighting are turned on and visibly glowing before capturing the photo."
    ],
    "visual_feedback": [
      "The 'CA$H 4 YOU' exterior signage appears unlit with no glowing illumination detected on the sign panels."
    ],
    "notes": ""
  },
  {
    "store": "053",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Turn on the sign's internal illumination (bulbs/back-lighting) so the sign is visibly glowing, then retake the photo."
    ],
    "visual_feedback": [
      "No visible glow or lit back-lighting on the storefront sign indicating illumination is off."
    ],
    "notes": ""
  },
  {
    "store": "057",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Illuminate the exterior signage by turning on the sign bulbs or back-lighting and retake the photo when the sign is visibly glowing."
    ],
    "visual_feedback": [
      "The sign face appears dark without any visible light glow around the letters, indicating the illumination is off."
    ],
    "notes": ""
  },
  {
    "store": "058",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Turn on the sign illumination ensuring that back-lighting or bulbs are visibly glowing, then retake the photo."
    ],
    "visual_feedback": [
      "No visible light emission from sign panels; appears unlit under daylight."
    ],
    "notes": ""
  },
  {
    "store": "061",
    "failed_criteria": [
      "Photo framing: the entire sign face is clearly visible and centered."
    ],
    "action_plan": [
      "Retake photo ensuring the entire sign face is centered and fully visible in the frame."
    ],
    "visual_feedback": [
      "Sign is positioned to the left of center with excess background on the right, not meeting the centering requirement."
    ],
    "notes": ""
  },
  {
    "store": "064",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Ensure exterior sign lighting (bulbs/back-lighting) is turned on and visibly glowing; retake photo when sign illumination is active."
    ],
    "visual_feedback": [
      "No glowing back-light is visible on the sign face; sign appears unlit and relying on natural daylight."
    ],
    "notes": ""
  },
  {
    "store": "068",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Turn on the sign’s internal illumination (bulbs or back-lighting) and retake the photo when the light source is visibly glowing."
    ],
    "visual_feedback": [
      "The storefront sign appears unlit and relies on ambient daylight; there is no visible glow from bulbs or back-lighting."
    ],
    "notes": ""
  },
  {
    "store": "070",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Turn on sign lighting or take photo after dark with the sign bulbs or back-lighting electricity turned on, ensuring the light source is visibly glowing"
    ],
    "visual_feedback": [
      "No visible glow from back-lighting on the sign face; sign appears only lit by ambient daylight in the timestamped image."
    ],
    "notes": ""
  },
  {
    "store": "072",
    "failed_criteria": [
      "Exterior signage is not fully illuminated"
    ],
    "action_plan": [
      "Turn on exterior sign lighting so bulbs or back-lighting are glowing; retake photo with illuminated signage."
    ],
    "visual_feedback": [
      "No visible glow from sign bulbs or back-lighting; sign appears unlit under natural daylight in the submission photo."
    ],
    "notes": ""
  },
  {
    "store": "074",
    "failed_criteria": [
      "Exterior signage is fully illuminated: Confirm that sign bulbs or back-lighting are actually turned on (i.e. you can see the light source glowing)."
    ],
    "action_plan": [
      "Activate the exterior sign's bulbs or back-lighting so that they are visibly glowing, then retake the photo ensuring the illumination is clearly captured."
    ],
    "visual_feedback": [
      "No visible glow from sign bulbs or back-lighting; sign appears only lit by ambient daylight."
    ],
    "notes": ""
  },
  {
    "store": "075",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Ensure store signage lighting is turned on and glowing before capturing the photo; retake photo with illuminated sign bulbs or back-lighting visible."
    ],
    "visual_feedback": [
      "No glowing light source visible on sign face; appears unlit under natural daylight."
    ],
    "notes": ""
  },
  {
    "store": "077",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Ensure exterior signage lighting is turned on and back-lighting is active during photo capture so that bulbs or LEDs are visibly glowing."
    ],
    "visual_feedback": [
      "The store sign appears dark under natural light with no active back-lighting or glowing bulbs."
    ],
    "notes": ""
  },
  {
    "store": "083",
    "failed_criteria": [
      "Exterior signage is fully illuminated: Confirm that sign bulbs or back-lighting are actually turned on (i.e. you can see the light source glowing)."
    ],
    "action_plan": [
      "Turn on the sign lighting (bulbs or back-lighting) before retaking the photo to show the illumination."
    ],
    "visual_feedback": [
      "No visible glow from bulbs or back-lighting on the sign in the submission photo (daylight only illumination)."
    ],
    "notes": ""
  },
  {
    "store": "088",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Ensure sign bulbs or back-lighting are turned on and visibly glowing during photo capture; retake photo with illumination active."
    ],
    "visual_feedback": [
      "Sign appearance lacks glowing back-lighting; appears unlit under daylight conditions."
    ],
    "notes": ""
  },
  {
    "store": "089",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Turn on the exterior signage illumination so that bulbs or back-lighting are visibly glowing before retaking the photo"
    ],
    "visual_feedback": [
      "No visible glow or back-lighting on the main 'Cash 4 You' sign panel indicating that the sign is not illuminated"
    ],
    "notes": ""
  },
  {
    "store": "091",
    "failed_criteria": [
      "Photo framing: the entire sign face is clearly visible and centered"
    ],
    "action_plan": [
      "Reframe photo so that the sign face is fully visible and centered in the image."
    ],
    "visual_feedback": [
      "The sign is positioned at the top right corner of the frame rather than centered."
    ],
    "notes": ""
  },
  {
    "store": "092",
    "failed_criteria": [
      "Exterior signage is not illuminated"
    ],
    "action_plan": [
      "Ensure exterior signage bulbs/back-lighting are turned on so the sign is visibly glowing at time of photo capture"
    ],
    "visual_feedback": [
      "Sign appears unlit with no visible glow from bulbs/back-lighting"
    ],
    "notes": ""
  },
  {
    "store": "093",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Activate sign bulbs or back-lighting and retake the photo during hours when the sign illumination is visible."
    ],
    "visual_feedback": [
      "No visible glow from sign bulbs or back-lighting on the sign face; sign appears unlit."
    ],
    "notes": ""
  },
  {
    "store": "096",
    "failed_criteria": [
      "Exterior signage is fully illuminated",
      "Photo framing: the entire sign face is clearly visible and centered"
    ],
    "action_plan": [
      "Ensure sign bulbs or back-lighting are turned on so the light source is visibly glowing and retake the photo",
      "Reframe the photo so that the entire sign face is centered in the image and clearly visible"
    ],
    "visual_feedback": [
      "No visible glow from sign bulbs or back-lighting in the submission photo",
      "Sign face is positioned to the right side of the frame rather than centered"
    ],
    "notes": ""
  },
  {
    "store": "097",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Ensure external signage lighting is turned on and visible when retaking the photo to show the lights actively glowing."
    ],
    "visual_feedback": [
      "No visible glow or back-lighting on the sign panels; appears unlit under daylight conditions."
    ],
    "notes": ""
  },
  {
    "store": "099",
    "failed_criteria": [
      "Exterior signage is fully illuminated",
      "Photo framing: the entire sign face is clearly visible and centered"
    ],
    "action_plan": [
      "Turn on exterior sign illumination when taking the photo; ensure sign bulbs/backlighting are glowing.",
      "Retake photo with the sign centered in the frame, ensuring the entire sign face is clearly visible and centered."
    ],
    "visual_feedback": [
      "In the photo timestamped 2025/05/15 13:32:30, the sign appears unlit with only natural daylight visible; no glowing back-lighting detected around the sign letters.",
      "The sign is positioned towards the right of the frame with excess building facade on the left, making the sign face not centered."
    ],
    "notes": ""
  },
  {
    "store": "100",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Turn on sign bulbs or back-lighting so the illumination is visibly glowing in the photo."
    ],
    "visual_feedback": [
      "Sign face appears unlit with no back-lighting visible."
    ],
    "notes": ""
  },
  {
    "store": "101",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Ensure exterior signage bulbs or back-lighting are turned on so the sign is visibly glowing when submitting the photo."
    ],
    "visual_feedback": [
      "No visible glow from sign back-lighting; sign appears unlit under current conditions."
    ],
    "notes": ""
  },
  {
    "store": "102",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Turn on the sign’s bulbs or back-lighting so that the illumination is clearly visible in the photo; retake the photo at night when the sign is lit."
    ],
    "visual_feedback": [
      "No visible glow from the sign’s lighting in the photo; letters appear dark against the background."
    ],
    "notes": ""
  },
  {
    "store": "106",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Turn on the sign’s bulbs or back-lighting so the light source is visibly glowing during the photo."
    ],
    "visual_feedback": [
      "No visible back-lighting glow; the sign appears unlit under daylight."
    ],
    "notes": ""
  },
  {
    "store": "109",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Ensure sign bulbs or back-lighting are turned on so illumination is clearly visible during photo capture."
    ],
    "visual_feedback": [
      "Top store sign appears unlit; no glowing light source visible behind or on letters."
    ],
    "notes": ""
  },
  {
    "store": "110",
    "failed_criteria": [
      "Exterior signage is fully illuminated"
    ],
    "action_plan": [
      "Turn on exterior sign illumination (bulbs/back-lighting) and retake photo after dusk to clearly show the glowing light source."
    ],
    "visual_feedback": [
      "Submission photo shows sign face under daylight without any visible back-lighting glow."
    ],
    "notes": ""
  }
]