[
  {
    "store": "039",
    "failed_criteria": [
      "Surfaces are even and free of major cracks or potholes that present a safety risk"
    ],
    "action_plan": [
      "Repair major cracks/potholes in walkway and parking surfaces to eliminate trip hazards"
    ],
    "visual_feedback": [
      "Visible large crack/pothole near painted parking lines in front of store entrance"
    ],
    "notes": ""
  },
  {
    "store": "045",
    "failed_criteria": [
      "Walkways and entrances are unobstructed"
    ],
    "action_plan": [
      "Ensure walkways and entrances are clear of parked vehicles; park vehicles fully within marked stalls and off the walkway."
    ],
    "visual_feedback": [
      "Vehicle encroaching the walkway at the store entrance, blocking safe passage."
    ],
    "notes": ""
  },
  {
    "store": "098",
    "failed_criteria": [
      "Walkways and entrances are unobstructed."
    ],
    "action_plan": [
      "Ensure walkways are clear by relocating the parked vehicle off the sidewalk so at least 75% of the walkway width remains unobstructed."
    ],
    "visual_feedback": [
      "Vehicle parked partially on the sidewalk, blocking the pedestrian path near the storefront."
    ],
    "notes": ""
  },
  {
    "store": "105",
    "failed_criteria": [
      "Surfaces are even and free of major cracks or potholes that present a safety risk."
    ],
    "action_plan": [
      "Repair or patch any major cracks or potholes in the walkway/parking area to ensure a smooth, safe surface free of trip hazards."
    ],
    "visual_feedback": [
      "Visible large pothole in the parking area near the center of the image creating a trip hazard."
    ],
    "notes": ""
  },
  {
    "store": "108",
    "failed_criteria": [
      "Submission photo unreviewable for assessing standard compliance"
    ],
    "action_plan": [
      "Retake photo for A3: Parking Lot & Walkways: Ensure image is clear, well-lit, correctly framed, and accurately shows the store’s parking lot or pedestrian walkway area directly in front of the entrance."
    ],
    "visual_feedback": [],
    "notes": "Incorrect photo submitted for A3: Parking Lot & Walkways; expected view of store parking lot or walkway, received distant street view. ACTION: Escalate for human review due to low confidence."
  }
]