[
  {
    "store": "010",
    "failed_criteria": [
      "Door handles display visible grime"
    ],
    "action_plan": [
      "Clean or replace the door handles and mounting hardware to remove visible grime and rust; ensure handles are free of dirt."
    ],
    "visual_feedback": [
      "Visible grime and rust on the door handle's mounting plate on the left side of the door."
    ],
    "notes": ""
  },
  {
    "store": "021",
    "failed_criteria": [
      "Door handles have visible grime"
    ],
    "action_plan": [
      "Thoroughly clean or replace door handles to remove all visible grime and rust, then retake photo for verification."
    ],
    "visual_feedback": [
      "Rust and grime are visible on the lower push bar handle and latch area of the door."
    ],
    "notes": ""
  },
  {
    "store": "022",
    "failed_criteria": [
      "Door handles may display approved signage; visible grime automatically disqualifies but fingerprints and minor smudges are acceptable."
    ],
    "action_plan": [
      "Retake photo including the door handle area and ensure no visible grime on the handle."
    ],
    "visual_feedback": [
      "Door handle area not visible in the current image; cannot assess cleanliness."
    ],
    "notes": ""
  },
  {
    "store": "033",
    "failed_criteria": [
      "Glass on doors is free of heavy dirt or debris"
    ],
    "action_plan": [
      "Clean the door glass to remove heavy dirt, debris, and tape residue to ensure door glass is clear."
    ],
    "visual_feedback": [
      "Peeling tape residue and dirt cover the central right glass panel, obstructing clear visibility."
    ],
    "notes": ""
  },
  {
    "store": "050",
    "failed_criteria": [
      "Door handles may display approved signage; visible grime automatically disqualifies but fingerprints and minor smudges are acceptable."
    ],
    "action_plan": [
      "Clean or replace the door handles to remove visible grime and ensure handles are free of dirt or rust."
    ],
    "visual_feedback": [
      "Visible grime/rust present on the right door handle near the lock mechanism."
    ],
    "notes": ""
  },
  {
    "store": "056",
    "failed_criteria": [
      "Glass on doors is free of heavy dirt or debris; minor reflections or cash4you related promotional signage are acceptable."
    ],
    "action_plan": [
      "Clean the glass door thoroughly to remove heavy dirt or debris, ensuring the surface is clear and reflective only of minor acceptable reflections."
    ],
    "visual_feedback": [
      "Heavy dirt spots and streaks visible across the door glass surface, especially in the upper half."
    ],
    "notes": ""
  }
]