[
  {
    "store": "010",
    "failed_criteria": [
      "Door handles may display approved signage; visible grime automatically disqualifies but fingerprints and minor smudges are acceptable."
    ],
    "action_plan": [
      "Clean or replace the door handles and surrounding hardware to remove all visible grime and rust."
    ],
    "visual_feedback": [
      "Visible rust and accumulated grime on the door handle plate and latch area."
    ],
    "notes": ""
  },
  {
    "store": "021",
    "failed_criteria": [
      "Door handles may display approved signage; visible grime automatically disqualifies but fingerprints and minor smudges are acceptable."
    ],
    "action_plan": [
      "Clean or replace the door handles to remove visible grime and rust, ensuring handles are free of dirt."
    ],
    "visual_feedback": [
      "Visible rust and grime on the right door handle near the latch mechanism."
    ],
    "notes": ""
  },
  {
    "store": "022",
    "failed_criteria": [
      "Submission photo unreviewable for assessing standard compliance"
    ],
    "action_plan": [
      "Retake photo for A4: Front Door & Entrance: Ensure image is clear, well-lit, correctly framed, and shows the entire front door including glass, door handles, promotional signage, hours-of-operation sign, and any safety/accessibility stickers."
    ],
    "visual_feedback": [],
    "notes": "Submission photo does not show the door handle or full entrance view; unable to assess checklist items. ACTION: Escalate for human review due to low confidence."
  },
  {
    "store": "033",
    "failed_criteria": [
      "Glass on doors is free of heavy dirt or debris; minor reflections or cash4you related promotional signage are acceptable.",
      "safety, legal compliance, or accessibility stickers/signage (such as “Automatic Caution Door” or ADA decals) are permitted on the door; tape residue is acceptable if it does not impede visibility."
    ],
    "action_plan": [
      "Thoroughly clean the glass door to remove all heavy dirt and tape residue; ensure the surface is clear and free of debris.",
      "Remove or replace tape residue near signage to restore full visibility through the door glass."
    ],
    "visual_feedback": [
      "Heavy tape residue covering central and lower portions of the glass door, impeding clear visibility through the door.",
      "Large areas of dirt and adhesive residue visible around the door edges, failing the clean-glass requirement."
    ],
    "notes": ""
  },
  {
    "store": "040",
    "failed_criteria": [
      "Door handles may display approved signage; visible grime automatically disqualifies but fingerprints and minor smudges are acceptable."
    ],
    "action_plan": [
      "Clean the door handles to remove visible grime and rust to comply with cleanliness standard."
    ],
    "visual_feedback": [
      "Left door handle shows rust and grime accumulation, particularly around the base of the handle."
    ],
    "notes": ""
  },
  {
    "store": "049",
    "failed_criteria": [
      "Door handles may display approved signage; visible grime automatically disqualifies but fingerprints and minor smudges are acceptable."
    ],
    "action_plan": [
      "Clean the door handles thoroughly to remove visible grime and residue, then retake the photo ensuring handles are free of dirt."
    ],
    "visual_feedback": [
      "Black residue visible at bottom of right door handle indicating grime."
    ],
    "notes": ""
  },
  {
    "store": "050",
    "failed_criteria": [
      "Door handles may display approved signage; visible grime automatically disqualifies but fingerprints and minor smudges are acceptable."
    ],
    "action_plan": [
      "Clean the door handles to remove visible grime; ensure handles are free of dirt or replace if necessary."
    ],
    "visual_feedback": [
      "Visible grime and corrosion on the right door handle near the lock mechanism."
    ],
    "notes": ""
  },
  {
    "store": "052",
    "failed_criteria": [
      "Door handles may display approved signage; visible grime automatically disqualifies but fingerprints and minor smudges are acceptable."
    ],
    "action_plan": [
      "Clean the door handle thoroughly to remove visible grime and residue before retaking the photo."
    ],
    "visual_feedback": [
      "Visible grime and residue around the mounting area of the door handle in the lower-center of the submission photo."
    ],
    "notes": ""
  }
]