[
  {
    "store": "004",
    "failed_criteria": [
      "Chairs are aligned in a straight line and flush against an adjacent surface (wall or window)."
    ],
    "action_plan": [
      "Reposition chairs so they are in a straight line and fully flush against the adjacent wall or window."
    ],
    "visual_feedback": [
      "Chairs near the entrance are staggered and have visible gaps from the wall."
    ],
    "notes": ""
  },
  {
    "store": "013",
    "failed_criteria": [
      "Chairs are aligned in a straight line and flush against an adjacent surface (wall or window)."
    ],
    "action_plan": [
      "Reposition all chairs so they form a straight line and sit flush against the glass window or wall surface."
    ],
    "visual_feedback": [
      "The two chairs near the entrance are positioned several inches away from the glass wall and are not perfectly aligned."
    ],
    "notes": ""
  },
  {
    "store": "017",
    "failed_criteria": [
      "Chairs are aligned in a straight line and flush against an adjacent surface (wall or window)"
    ],
    "action_plan": [
      "Re-align chairs so they sit flush against the wall in a straight line under the posters."
    ],
    "visual_feedback": [
      "Chairs under the posters (center of the lobby) are positioned with a gap from the wall and not perfectly aligned."
    ],
    "notes": ""
  },
  {
    "store": "019",
    "failed_criteria": [
      "Chairs are aligned in a straight line and flush against an adjacent surface (wall or window)."
    ],
    "action_plan": [
      "Reposition chairs to align in a straight line and ensure they are flush against an adjacent surface (wall or window)."
    ],
    "visual_feedback": [
      "Chairs near the window are angled away from the wall and not flush against the adjacent surface."
    ],
    "notes": ""
  },
  {
    "store": "021",
    "failed_criteria": [
      "Chairs are aligned in a straight line and flush against an adjacent surface (wall or window)."
    ],
    "action_plan": [
      "Realign chairs in a straight line and ensure they are flush against the adjacent wall or window."
    ],
    "visual_feedback": [
      "Chairs near the window (third image) have visible gaps from the wall and are not aligned in a straight line."
    ],
    "notes": ""
  },
  {
    "store": "024",
    "failed_criteria": [
      "Submission photo unreviewable for assessing standard compliance"
    ],
    "action_plan": [
      "Retake photo for B1: Lobby Cleanliness & Furniture Condition: Ensure image is clear, well-lit, correctly framed, and accurately shows the required area/details as per policy guidelines."
    ],
    "visual_feedback": [],
    "notes": "Incorrect photo submitted for B1: Lobby Cleanliness & Furniture Condition; expected view of chairs and full lobby area. ACTION: Escalate for human review due to low confidence."
  },
  {
    "store": "045",
    "failed_criteria": [
      "Chairs are aligned in a straight line and flush against an adjacent surface (wall or window)."
    ],
    "action_plan": [
      "Align all chairs in a straight line and ensure they are flush against the wall or window."
    ],
    "visual_feedback": [
      "The front chair near the camera is angled away and not flush against the window."
    ],
    "notes": ""
  },
  {
    "store": "047",
    "failed_criteria": [
      "Submission photo unreviewable for assessing standard compliance"
    ],
    "action_plan": [
      "Retake photo for B1: Lobby Cleanliness & Furniture Condition: Ensure image is clear, well-lit, correctly framed, and accurately shows the required area/details as per policy guidelines."
    ],
    "visual_feedback": [],
    "notes": "Incorrect photo submitted for B1: Lobby Cleanliness & Furniture Condition; expected view of furniture and floor area. ACTION: Escalate for human review due to low confidence."
  },
  {
    "store": "049",
    "failed_criteria": [
      "Chairs are aligned in a straight line but not flush against an adjacent surface (wall or window)."
    ],
    "action_plan": [
      "Adjust chairs so they are aligned in a straight line and flush against the adjacent surface (wall or window)."
    ],
    "visual_feedback": [
      "Visible gap between chairs and window wall in submission photos, indicating chairs are not flush."
    ],
    "notes": ""
  },
  {
    "store": "053",
    "failed_criteria": [
      "Chairs are aligned in a straight line and flush against an adjacent surface (wall or window)"
    ],
    "action_plan": [
      "Align chairs in a straight line flush against the wall or window, matching the gold standard layout"
    ],
    "visual_feedback": [
      "Chairs near the entrance are angled and not flush against the wall"
    ],
    "notes": ""
  },
  {
    "store": "056",
    "failed_criteria": [
      "Chairs are aligned in a straight line and flush against an adjacent surface (wall or window)"
    ],
    "action_plan": [
      "Reposition all chairs so they are aligned in a straight line and pushed flush against the adjacent wall or window."
    ],
    "visual_feedback": [
      "Chairs in the seating area are currently clustered away from the wall and not aligned; please see the right side of the photo for reference."
    ],
    "notes": ""
  },
  {
    "store": "066",
    "failed_criteria": [
      "Chairs are aligned in a straight line and flush against an adjacent surface (wall or window)"
    ],
    "action_plan": [
      "Rearrange chairs in a straight line against the wall or window and retake photo to show alignment."
    ],
    "visual_feedback": [
      "Bottom-left chair is positioned away from wall and not in line with other seating."
    ],
    "notes": ""
  },
  {
    "store": "070",
    "failed_criteria": [
      "Chairs are aligned in a straight line and flush against an adjacent surface (wall or window)",
      "Furniture is free of stains, dust, or visible wear"
    ],
    "action_plan": [
      "Rearrange all chairs so they form a single straight line and sit flush against the wall or window; remove any office-style chair from the seating line.",
      "Replace or repair chairs showing tears, wear, or dust; clean all furniture surfaces to remove dust and ensure no visible stains or damage."
    ],
    "visual_feedback": [
      "Third submission photo: office-style chair is pulled forward and not flush against the window wall.",
      "Third submission photo: right-most seating chairs exhibit visible wear and dust on the upholstery."
    ],
    "notes": ""
  },
  {
    "store": "087",
    "failed_criteria": [
      "Chairs are not aligned in a straight line and flush against an adjacent surface (wall or window)."
    ],
    "action_plan": [
      "Realign chairs so they are in a straight line and flush against the wall or window."
    ],
    "visual_feedback": [
      "Chairs along the window are slightly pulled out from the surface and misaligned."
    ],
    "notes": ""
  },
  {
    "store": "090",
    "failed_criteria": [
      "Chairs are aligned in a straight line and flush against an adjacent surface (wall or window)."
    ],
    "action_plan": [
      "Realign chairs in a straight line flush against the adjacent wall or window."
    ],
    "visual_feedback": [
      "Chairs on the right side of the lobby appear angled and not placed flush against the wall."
    ],
    "notes": ""
  },
  {
    "store": "093",
    "failed_criteria": [
      "Chairs are not aligned in a straight line and flush against an adjacent surface (wall or window)."
    ],
    "action_plan": [
      "Adjust the seating chairs so they form a straight line and are pushed flush against the wall or window surface."
    ],
    "visual_feedback": [
      "In the third submission image, the row of chairs near the entrance has visible gaps from the window wall—they need to be pushed back until they sit flush."
    ],
    "notes": ""
  },
  {
    "store": "098",
    "failed_criteria": [
      "All glass and hard surfaces are free of smudges or dust."
    ],
    "action_plan": [
      "Clean all glass surfaces to remove graffiti, smudges, and any marks to restore clarity and cleanliness."
    ],
    "visual_feedback": [
      "Graffiti visible on front glass windows near the seating area."
    ],
    "notes": ""
  },
  {
    "store": "099",
    "failed_criteria": [
      "Chairs are aligned in a straight line and flush against an adjacent surface (wall or window)."
    ],
    "action_plan": [
      "Realign all chairs in a single straight line and ensure they are flush against the wall or window."
    ],
    "visual_feedback": [
      "The two chairs near the front window are spaced unevenly and not flush against the window surface."
    ],
    "notes": ""
  }
]