[
  {
    "store": "024",
    "failed_criteria": [
      "Submission photo unreviewable for assessing standard compliance"
    ],
    "action_plan": [
      "Retake photo for B1: Lobby Cleanliness & Furniture Condition: Ensure image is clear, well-lit, correctly framed, and shows the required lobby seating area and furniture per policy guidelines."
    ],
    "visual_feedback": [],
    "notes": "Incorrect photo submitted for B1: Lobby Cleanliness & Furniture Condition; chairs and furniture not visible."
  },
  {
    "store": "047",
    "failed_criteria": [
      "Submission photo unreviewable for assessing standard compliance"
    ],
    "action_plan": [
      "Retake photo for B1: Lobby Cleanliness & Furniture Condition: Ensure image is clear, well-lit, correctly framed, and accurately shows the required seating area and furniture condition as per policy guidelines."
    ],
    "visual_feedback": [],
    "notes": "Incorrect photo submitted for B1: Lobby Cleanliness & Furniture Condition; expected view of lobby seating area with chairs, floor, and furniture, received teller counter. ACTION: Escalate for human review due to low confidence."
  },
  {
    "store": "053",
    "failed_criteria": [
      "Chairs are aligned in a straight line and flush against an adjacent surface (wall or window)."
    ],
    "action_plan": [
      "Rearrange chairs to be aligned in a straight line and flush against the adjacent surface, matching the arrangement shown in the gold standard photo."
    ],
    "visual_feedback": [
      "The chairs near the entrance are clustered and not flush against the wall; they should be aligned in a straight row against the adjacent surface."
    ],
    "notes": ""
  },
  {
    "store": "056",
    "failed_criteria": [
      "Chairs are not aligned in a straight line and flush against an adjacent surface"
    ],
    "action_plan": [
      "Rearrange chairs so they are aligned in a straight line and flush against the wall or window, matching the gold standard arrangement."
    ],
    "visual_feedback": [
      "Chairs visible on the right side of the lobby are grouped and not flush against the wall or window, deviating from the required arrangement."
    ],
    "notes": ""
  },
  {
    "store": "068",
    "failed_criteria": [
      "Submission photo unreviewable for assessing standard compliance"
    ],
    "action_plan": [
      "Retake photo for B1: Lobby Cleanliness & Furniture Condition: Ensure image is clear, well-lit, correctly framed, and accurately shows the required area/details as per policy guidelines."
    ],
    "visual_feedback": [],
    "notes": "Incorrect photo submitted for B1: Lobby Cleanliness & Furniture Condition; expected view of seating area, received primarily service counter view. ACTION: Escalate for human review due to low confidence."
  }
]