[
  {
    "store": "031",
    "failed_criteria": [
      "All staff in photo wear proper professional tops suitable for office work (e.g., shirts, blouses, low-contrast florals) without prominent logos, funky patterns, bright/neon colors, or streetwear styles.",
      "No unauthorized outerwear (e.g., hats, hoodies) obstructing attire or name tags."
    ],
    "action_plan": [
      "Replace hoodie with a professional top such as a shirt or blouse without streetwear elements.",
      "Ensure no hoodies or other unauthorized outerwear are worn indoors so the uniform and name tag remain fully visible."
    ],
    "visual_feedback": [
      "The staff member is wearing a casual hoodie which is streetwear-style and not professional attire.",
      "A hoodie is present, which is listed as unauthorized outerwear under this standard."
    ],
    "notes": ""
  },
  {
    "store": "039",
    "failed_criteria": [
      "All staff in photo wear proper professional tops suitable for office work (e.g., shirts, blouses, low-contrast florals) without prominent logos, funky patterns, bright/neon colors, or streetwear styles."
    ],
    "action_plan": [
      "Ensure all staff wear professional tops in neutral or muted colors without extremely bright/neon hues or loud patterns."
    ],
    "visual_feedback": [
      "Submission photo shows a neon green floral outfit that is too bright and distracting for a professional office environment."
    ],
    "notes": ""
  },
  {
    "store": "042",
    "failed_criteria": [
      "Name tags missing or not visible above the chest for all staff in the photo"
    ],
    "action_plan": [
      "Ensure all staff wear name tags above the chest and are clearly visible in the photo. Retake the photo after correcting this issue."
    ],
    "visual_feedback": [
      "Name tag not visible on staff on the left wearing a grey cardigan",
      "Name tag not visible on staff on the right wearing a dark top"
    ],
    "notes": ""
  },
  {
    "store": "052",
    "failed_criteria": [
      "Name tags are worn above the chest, clearly visible.",
      "No unauthorized outerwear (e.g., hats, hoodies) obstructing attire or name tags."
    ],
    "action_plan": [
      "Ensure each staff member wears a visible name tag above the chest in the photo.",
      "Remove any hats or hoodies that cover attire or name tags when taking the photo."
    ],
    "visual_feedback": [
      "No name tag visible on the staff member’s chest area.",
      "Hat detected covering the staff member’s head and hood covering upper uniform."
    ],
    "notes": ""
  },
  {
    "store": "058",
    "failed_criteria": [
      "Name tags are worn above the chest, clearly visible."
    ],
    "action_plan": [
      "Ensure all staff wear name tags above the chest, clearly visible in the photo."
    ],
    "visual_feedback": [
      "No name tag visible on the staff member's chest."
    ],
    "notes": ""
  },
  {
    "store": "070",
    "failed_criteria": [
      "All staff in photo wear proper professional tops suitable for office work"
    ],
    "action_plan": [
      "Ensure all staff wear professional tops free of prominent logos or novelty patterns; replace the multicolor designer-logo shirt with a solid-color or Cash 4 You branded top and retake the photo."
    ],
    "visual_feedback": [
      "First staff member (timestamped 2025/06/11 18:14:27) is wearing a brightly colored designer-logo patterned shirt, which is not acceptable professional attire."
    ],
    "notes": ""
  },
  {
    "store": "090",
    "failed_criteria": [
      "No unauthorized outerwear (e.g., hats, hoodies) obstructing attire or name tags"
    ],
    "action_plan": [
      "Ensure staff remove unauthorized outerwear (e.g., hoodies) indoors so that attire and name tags are fully visible"
    ],
    "visual_feedback": [
      "Older staff member on the left is wearing a beige hoodie indoors, which is unauthorized outerwear"
    ],
    "notes": ""
  },
  {
    "store": "092",
    "failed_criteria": [
      "All staff in photo wear proper professional tops suitable for office work (e.g., shirts, blouses, low-contrast florals) without prominent logos, funky patterns, bright/neon colors, or streetwear styles."
    ],
    "action_plan": [
      "Have staff wear professional tops in neutral or subdued colors, avoiding bright or neon hues; ensure attire is clearly suitable for a professional office environment."
    ],
    "visual_feedback": [
      "The bright blue top/dress worn by the staff member is too loud and does not meet the subdued color requirement."
    ],
    "notes": ""
  },
  {
    "store": "093",
    "failed_criteria": [
      "All staff in photo wear proper professional tops suitable for office work (e.g., shirts, blouses)"
    ],
    "action_plan": [
      "Ensure all staff wear professional tops suitable for office work, such as shirts or blouses with appropriate necklines; avoid dresses with spaghetti straps or informal attire."
    ],
    "visual_feedback": [
      "Employee in the first submission photo is wearing a spaghetti-strap dress under a cardigan, which does not meet the professional tops requirement."
    ],
    "notes": ""
  },
  {
    "store": "108",
    "failed_criteria": [
      "Name tags are worn above the chest, clearly visible."
    ],
    "action_plan": [
      "Ensure all staff wear a visible name tag above the chest and retake the photo."
    ],
    "visual_feedback": [
      "No name tag visible on the individual’s chest area."
    ],
    "notes": ""
  }
]