[
  {
    "store": "004",
    "failed_criteria": [
      "No cleaning supplies left out."
    ],
    "action_plan": [
      "Remove any cleaning supplies from the teller station area before taking the photo."
    ],
    "visual_feedback": [
      "Cleaning supply bottle visible on the lower shelf of the center teller station."
    ],
    "notes": ""
  },
  {
    "store": "006",
    "failed_criteria": [
      "No excessive paper or personal items visible.",
      "Only official materials present (forms, stamps, etc.).",
      "All items neatly arranged."
    ],
    "action_plan": [
      "Remove excess paper and personal items from the teller station.",
      "Ensure only official materials (forms, stamps, etc.) are present.",
      "Arrange all items neatly according to the gold standard layout."
    ],
    "visual_feedback": [
      "Excessive paper visible hanging from cubby and scattered on countertop.",
      "Non-official items (storage boxes under printer) present on station.",
      "Clutter and disorganization visible on workstation shelves and countertop."
    ],
    "notes": ""
  },
  {
    "store": "014",
    "failed_criteria": [
      "No cleaning supplies left out"
    ],
    "action_plan": [
      "Remove all cleaning supplies from the teller station counter prior to submission"
    ],
    "visual_feedback": [
      "Cleaning spray bottle visible on the far right of the counter."
    ],
    "notes": ""
  },
  {
    "store": "017",
    "failed_criteria": [
      "No cleaning supplies left out"
    ],
    "action_plan": [
      "Remove any cleaning supplies from the teller station area to comply with the standard"
    ],
    "visual_feedback": [
      "Hand sanitizer bottle visible on the teller counter near the window, which is a cleaning supply not permitted."
    ],
    "notes": ""
  },
  {
    "store": "019",
    "failed_criteria": [
      "No excessive paper or personal items visible.",
      "All items neatly arranged."
    ],
    "action_plan": [
      "Remove excess paper from the station surface and shelves; store personal items out of view or within drawers.",
      "Organize items neatly on the station; secure cables and ensure uniform arrangement as per standard."
    ],
    "visual_feedback": [
      "Excess papers visible under the station shelves and a hanging sheet on the front panel.",
      "Cables under the counter are tangled and items on shelves appear disorganized."
    ],
    "notes": ""
  },
  {
    "store": "026",
    "failed_criteria": [
      "No excessive paper or personal items visible",
      "All items neatly arranged"
    ],
    "action_plan": [
      "Remove any unnecessary paper or personal items from the teller station; only display required materials.",
      "Organize all items neatly, ensuring papers and materials are stored properly and not left in cluttered piles."
    ],
    "visual_feedback": [
      "Pile of papers visible on the shelf beneath the printer at the right side of the photo, indicating excessive paper clutter.",
      "Papers under the printer are unorganized and scattered, failing the neatly arranged requirement."
    ],
    "notes": ""
  },
  {
    "store": "027",
    "failed_criteria": [
      "No cleaning supplies left out",
      "Only official materials present"
    ],
    "action_plan": [
      "Remove all cleaning supplies from the teller station before taking the photo",
      "Ensure that only official materials (forms, stamps, etc.) are visible on the teller station"
    ],
    "visual_feedback": [
      "Cleaning spray bottle is visible on the open shelf under the counter",
      "Non-official cleaning supplies present, violating only official materials requirement"
    ],
    "notes": ""
  },
  {
    "store": "033",
    "failed_criteria": [
      "No cleaning supplies left out"
    ],
    "action_plan": [
      "Store all cleaning supplies in designated storage area away from teller station"
    ],
    "visual_feedback": [
      "Cleaning supply bottle visible on cart next to printer in third submission photo"
    ],
    "notes": ""
  },
  {
    "store": "040",
    "failed_criteria": [
      "No excessive paper or personal items visible",
      "All items neatly arranged"
    ],
    "action_plan": [
      "Remove unnecessary papers from the teller station; store only required forms in designated organizers.",
      "Neatly arrange all items on the counter; tuck loose papers into folders or trays and ensure no items hang out of cubbies."
    ],
    "visual_feedback": [
      "Loose paper hanging from cubby on right side of counter.",
      "Stack of papers under the monitor appears disorganized."
    ],
    "notes": ""
  },
  {
    "store": "043",
    "failed_criteria": [
      "No excessive paper or personal items visible.",
      "Only official materials present (forms, stamps, etc.)"
    ],
    "action_plan": [
      "Remove personal items (e.g., coffee mug) from the teller station to maintain a professional workspace.",
      "Ensure only official materials (forms, stamps) are present on the station and remove any non-official items."
    ],
    "visual_feedback": [
      "Personal coffee mug located on the left side of the counter near the computer, violating the no-personal-items policy.",
      "Personal coffee mug also violates the requirement for only official materials present."
    ],
    "notes": ""
  },
  {
    "store": "045",
    "failed_criteria": [
      "No cleaning supplies left out."
    ],
    "action_plan": [
      "Remove all cleaning supplies from the teller station area to comply with policy."
    ],
    "visual_feedback": [
      "Hand sanitizer bottle visible on the shelf under the counter."
    ],
    "notes": ""
  },
  {
    "store": "046",
    "failed_criteria": [
      "No excessive paper or personal items visible.",
      "Only official materials present (forms, stamps, etc.)."
    ],
    "action_plan": [
      "Remove all personal items such as portable fans from the teller station.",
      "Ensure only official materials (approved forms, stamps, etc.) are present; remove any non-official items."
    ],
    "visual_feedback": [
      "Portable fan on counter behind the monitor (visible in images 3 and 4) is a personal item."
    ],
    "notes": ""
  },
  {
    "store": "049",
    "failed_criteria": [
      "No cleaning supplies left out."
    ],
    "action_plan": [
      "Remove all cleaning supplies, such as hand sanitizer bottles, from the teller station before submitting the photo."
    ],
    "visual_feedback": [
      "Hand sanitizer bottle visible on countertop near monitor in the submission photo."
    ],
    "notes": ""
  },
  {
    "store": "058",
    "failed_criteria": [
      "No excessive paper or personal items visible.",
      "Only official materials present (forms, stamps, etc.).",
      "All items neatly arranged."
    ],
    "action_plan": [
      "Remove unnecessary papers and personal items from the teller station; keep only essential documents in designated holders.",
      "Ensure only approved bank materials are present; remove unauthorized items such as the personal fan.",
      "Organize remaining items neatly using trays or holders for documents and supplies."
    ],
    "visual_feedback": [
      "Multiple loose papers hanging under the counter cubbies and a personal fan on the right side.",
      "A personal fan next to the printer and loose documents not stored in official holders.",
      "Disorganized papers under the counter, unevenly hung and cluttered."
    ],
    "notes": ""
  },
  {
    "store": "063",
    "failed_criteria": [
      "No cleaning supplies left out"
    ],
    "action_plan": [
      "Remove all cleaning supplies from the teller station before taking the photo."
    ],
    "visual_feedback": [
      "Visible hand sanitizer bottle on the countertop to the left of the monitor."
    ],
    "notes": ""
  },
  {
    "store": "064",
    "failed_criteria": [
      "No cleaning supplies left out",
      "All items neatly arranged"
    ],
    "action_plan": [
      "Remove any cleaning supplies from the teller station; store cloths and sprays in designated cleaning supply area out of customer view.",
      "Rearrange all materials and equipment so that pens, forms, and devices are aligned neatly and consistently as per the gold standard layout."
    ],
    "visual_feedback": [
      "Photo 3: Yellow cleaning cloth left out next to pens on the counter.",
      "Overall station: Items and equipment appear unevenly spaced and not aligned along counter edges."
    ],
    "notes": ""
  },
  {
    "store": "087",
    "failed_criteria": [
      "All items neatly arranged"
    ],
    "action_plan": [
      "Organize all papers and materials neatly in trays or holders; ensure items are arranged in straight order according to policy guidelines."
    ],
    "visual_feedback": [
      "The stack of papers in the wooden organizer at the lower right appears disorganized and leaning."
    ],
    "notes": ""
  },
  {
    "store": "090",
    "failed_criteria": [
      "No cleaning supplies left out."
    ],
    "action_plan": [
      "Remove cleaning supplies from the teller station area when not in use; store them in designated cleaning supply storage."
    ],
    "visual_feedback": [
      "A hand sanitizer bottle (cleaning supply) is visible on the counter near the window at the far right of the teller station."
    ],
    "notes": ""
  },
  {
    "store": "092",
    "failed_criteria": [
      "No excessive paper or personal items visible.",
      "No cleaning supplies left out."
    ],
    "action_plan": [
      "Remove any unnecessary paper from the teller station; only display official forms as per policy.",
      "Store cleaning supplies out of customer view after use."
    ],
    "visual_feedback": [
      "Photo shows a loose paper hanging on the shelf beneath the counter, which is not an official material.",
      "Photo shows cleaning supply bottles placed on the counter next to pens."
    ],
    "notes": ""
  },
  {
    "store": "102",
    "failed_criteria": [
      "No excessive paper or personal items visible."
    ],
    "action_plan": [
      "Remove personal items such as water bottles from the teller station and keep only official materials."
    ],
    "visual_feedback": [
      "Personal water bottle visible on the lower shelf of the teller station."
    ],
    "notes": ""
  },
  {
    "store": "108",
    "failed_criteria": [
      "Only official materials present (forms, stamps, etc.)",
      "No cleaning supplies left out",
      "All items neatly arranged"
    ],
    "action_plan": [
      "Remove non-official items from the teller station and store them appropriately off the counter or in designated areas.",
      "Store cleaning supplies in the janitorial closet; ensure none are left out at the teller station.",
      "Neatly arrange all items at the teller station, organize wires, and use proper organizers to maintain a tidy appearance."
    ],
    "visual_feedback": [
      "Non-official cleaning supplies (white rolls and purple box) visible on the center bottom shelf.",
      "Cleaning supplies are left out next to the printer station on the right side.",
      "Wires and items under the counters appear cluttered and disorganized."
    ],
    "notes": ""
  }
]