[
  {
    "store": "006",
    "failed_criteria": [
      "All items neatly arranged"
    ],
    "action_plan": [
      "Reorganize the teller station: neatly arrange all items, secure loose papers, tuck away hanging forms, and organize cables to reduce clutter."
    ],
    "visual_feedback": [
      "Loose papers hanging from counter drawers",
      "Tangled cables visible on the floor near the printer",
      "Stacks of boxes next to the printer causing clutter"
    ],
    "notes": ""
  },
  {
    "store": "019",
    "failed_criteria": [
      "No excessive paper or personal items visible.",
      "All items neatly arranged."
    ],
    "action_plan": [
      "Remove distracting excess items from the teller counter area to maintain a clean, uncluttered workspace.",
      "Organize and secure cables and loose items under the counter to ensure all materials appear neatly arranged."
    ],
    "visual_feedback": [
      "Cluttered cables, a hanging poster, and loose items under the teller counter create a distracting appearance.",
      "Tangled wires and items on the floor under the counter are visible and need to be organized."
    ],
    "notes": ""
  },
  {
    "store": "026",
    "failed_criteria": [
      "No excessive paper or personal items visible.",
      "All items neatly arranged."
    ],
    "action_plan": [
      "Remove excess papers from the printer shelf and floor to keep the teller area neat and uncluttered.",
      "Rearrange and organize remaining items so the counter appears professional and free of clutter."
    ],
    "visual_feedback": [
      "Scattered papers and clutter visible under and around the printer on the right side of the station.",
      "Loose papers on the floor and disorganized shelf near the printer indicate the area is not neatly arranged."
    ],
    "notes": ""
  },
  {
    "store": "052",
    "failed_criteria": [
      "All items neatly arranged"
    ],
    "action_plan": [
      "Organize and secure cables around the teller station: use cable management solutions or conceal power strips to ensure all items are neatly arranged."
    ],
    "visual_feedback": [
      "Tangled cables and visible power strip on the floor next to the rightmost teller station."
    ],
    "notes": ""
  },
  {
    "store": "087",
    "failed_criteria": [
      "All items neatly arranged"
    ],
    "action_plan": [
      "Neatly organize cables and wires: use cable management (clips, ties) to secure cords behind the teller station out of sight."
    ],
    "visual_feedback": [
      "Cables and extension cord visibly cluttered on the floor near the printer."
    ],
    "notes": ""
  }
]