[
  {
    "store": "005",
    "failed_criteria": [
      "No Hazardous Dangling"
    ],
    "action_plan": [
      "Secure and route under-desk cables away from walkways by using cable clips or raceways to keep cables off the floor and eliminate tripping hazards."
    ],
    "visual_feedback": [
      "A loose cable and power strip are visible running across the floor under the desk, crossing the foot traffic zone."
    ],
    "notes": ""
  },
  {
    "store": "006",
    "failed_criteria": [
      "Overall Tidy Appearance",
      "No Hazardous Dangling"
    ],
    "action_plan": [
      "Use cable clips or ties to bundle and route cables neatly behind the workstation to reduce visual clutter.",
      "Reroute cables so they do not lie across foot traffic zones; secure them along the desk underside or baseboard away from walkways."
    ],
    "visual_feedback": [
      "Multiple loose cables draped behind the CPU creating excessive visual clutter.",
      "A cable is lying across the foot traffic zone on the floor under the desk, posing a tripping hazard."
    ],
    "notes": ""
  },
  {
    "store": "012",
    "failed_criteria": [
      "Overall Tidy Appearance"
    ],
    "action_plan": [
      "Route cables into a single, secure bundle using clips or ties to eliminate large tangles and visual clutter, following the gold standard configuration."
    ],
    "visual_feedback": [
      "Tangled cables behind the computer on the shelf form a large cluster that exceeds acceptable neatness (center and top-right of cabinet)."
    ],
    "notes": ""
  },
  {
    "store": "015",
    "failed_criteria": [
      "Overall Tidy Appearance",
      "No Hazardous Dangling"
    ],
    "action_plan": [
      "Bundle and secure cables using clips or ties to avoid tangles and visual clutter, following gold standard reference.",
      "Ensure no cables cross walkways or foot traffic; route cables along edges or behind furniture to eliminate tripping hazards."
    ],
    "visual_feedback": [
      "Multiple cables on the shelf are loosely tangled without bundling (visible in the photo of the cabinet interior).",
      "A cable crosses the open floor area under the desk, posing a tripping hazard (visible in the under-desk photo with carpet)."
    ],
    "notes": ""
  },
  {
    "store": "016",
    "failed_criteria": [
      "Overall Tidy Appearance"
    ],
    "action_plan": [
      "Re-route and bundle the loose cables into neat groups using cable ties or clips to eliminate tangled loops and visual clutter, matching the gold standard example."
    ],
    "visual_feedback": [
      "Tangled loops of cables visible behind the PC near the top of the compartment.",
      "Clustered cables under the shelf appear disorganized and create excessive visual clutter."
    ],
    "notes": ""
  },
  {
    "store": "017",
    "failed_criteria": [
      "Overall Tidy Appearance"
    ],
    "action_plan": [
      "Route and bundle all cables into neat groups using ties or clips to eliminate loose tangles and reduce visual clutter."
    ],
    "visual_feedback": [
      "Center station cabinet: cables behind the PC are tangled and not secured, creating excessive visual clutter."
    ],
    "notes": ""
  },
  {
    "store": "019",
    "failed_criteria": [
      "No Hazardous Dangling: Cables extend into walkways or open areas posing a tripping risk."
    ],
    "action_plan": [
      "Re-route or secure the cable that crosses under the desk so it will no longer extend into walkways or foot traffic zones (e.g., attach it to the underside of the desk or run it along the wall)."
    ],
    "visual_feedback": [
      "Cable running across the open floor under the desk, visible in the desk-level photos."
    ],
    "notes": ""
  },
  {
    "store": "022",
    "failed_criteria": [
      "Overall Tidy Appearance",
      "No Hazardous Dangling"
    ],
    "action_plan": [
      "Bundle or clip cables to reduce tangles and visual clutter under the desk.",
      "Secure loose cables off the floor and away from walkways to eliminate tripping hazards."
    ],
    "visual_feedback": [
      "Loose cable loops and tangled wires visible around the power strip under the desk.",
      "A loose cable is lying across the floor under the desk, posing a potential tripping hazard."
    ],
    "notes": ""
  },
  {
    "store": "024",
    "failed_criteria": [
      "Overall Tidy Appearance",
      "No Hazardous Dangling"
    ],
    "action_plan": [
      "Use cable ties or clips to bundle and secure loose cables behind the desk to eliminate tangled loops and excessive visual clutter.",
      "Re-route cables along the underside of the desk or against the wall so they do not cross open floor or foot traffic areas."
    ],
    "visual_feedback": [
      "Loose, tangled cables visible behind the PC unit under the shelf creating excessive clutter.",
      "A cable runs across the floor under the desk in the foot path, posing a tripping hazard."
    ],
    "notes": ""
  },
  {
    "store": "026",
    "failed_criteria": [
      "Overall Tidy Appearance: cables appear tangled and cluttered under the desk compartment",
      "No Hazardous Dangling: cable extends across foot traffic area creating a tripping hazard"
    ],
    "action_plan": [
      "Bundle and secure loose cables under the desk using cable ties or a cable management tray to eliminate visible tangles.",
      "Reroute the cable that crosses the floor so it runs along the desk edge or is fastened under the desk, removing any tripping hazards."
    ],
    "visual_feedback": [
      "Loose, tangled cables visible under the desk compartment (bottom left of image).",
      "Single cable running across the floor under the desk, posing a tripping hazard (center of image)."
    ],
    "notes": ""
  },
  {
    "store": "027",
    "failed_criteria": [
      "No Hazardous Dangling"
    ],
    "action_plan": [
      "Secure or reroute the cable on the floor to avoid crossing the open area under the desk; use cable clips or raceways to keep cables off the floor and away from foot traffic."
    ],
    "visual_feedback": [
      "Black cable visible across the open floor area under the desk posing a potential trip hazard."
    ],
    "notes": ""
  },
  {
    "store": "030",
    "failed_criteria": [
      "Overall Tidy Appearance: Cables should appear reasonably routed. Small loose segments are acceptable as long as there are no large tangles or excessive visual clutter. A simple bundle, clip, or tied group of wires counts as tidy."
    ],
    "action_plan": [
      "Re-bundle and secure loose cables under the desk and inside the cabinet using cable ties or clips to eliminate large tangles and visual clutter."
    ],
    "visual_feedback": [
      "Large cluster of tangled cables visible on the cabinet floor under the desk on the right side of the submission photo."
    ],
    "notes": ""
  },
  {
    "store": "033",
    "failed_criteria": [
      "Overall Tidy Appearance: Cables should appear reasonably routed without large tangles or excessive clutter.",
      "No Hazardous Dangling: Cables must not extend into walkways, doorways, or foot traffic zones."
    ],
    "action_plan": [
      "Bundle and secure loose cables behind the desk using cable ties or management clips to reduce tangles and visual clutter.",
      "Re-route or secure cables off the floor and away from walkways; use cable clips or trunking to keep cables off the ground and out of foot traffic zones."
    ],
    "visual_feedback": [
      "Loose, tangled cables visible behind the PC on the right side shelf create visual clutter.",
      "A cable is running across the front floor area under the desk, posing a tripping hazard."
    ],
    "notes": ""
  },
  {
    "store": "037",
    "failed_criteria": [
      "Overall Tidy Appearance"
    ],
    "action_plan": [
      "Bundle and secure all loose cable segments using zip ties or a cable management tray to reduce visual clutter and improve neatness."
    ],
    "visual_feedback": [
      "Cables fanning from the network connection box are not grouped or clipped, creating visual clutter on the back wall.",
      "Loose cable loops on the shelf behind the PC appear disorganized."
    ],
    "notes": ""
  },
  {
    "store": "039",
    "failed_criteria": [
      "No Hazardous Dangling"
    ],
    "action_plan": [
      "Secure and route under-desk cables away from walkways by using cable clips or raceways to keep cables off the floor and eliminate tripping hazards."
    ],
    "visual_feedback": [
      "A loose cable and power strip are visible running across the floor under the desk, crossing the foot traffic zone."
    ],
    "notes": ""
  },
  {
    "store": "040",
    "failed_criteria": [
      "Overall Tidy Appearance",
      "No Hazardous Dangling"
    ],
    "action_plan": [
      "Bundle and secure cables behind the desk with clips or ties to eliminate tangles and clutter.",
      "Re-route or secure the red cable so it does not cross the floor or walkways, using cable clips or conduits."
    ],
    "visual_feedback": [
      "Cluster of tangled cables visible in the back right cabinet (timestamp 2025/05/16 10:36:03).",
      "Red cable runs across the open floor in front of the desk (timestamp 2025/05/16 10:37:30)."
    ],
    "notes": ""
  },
  {
    "store": "041",
    "failed_criteria": [
      "Overall Tidy Appearance"
    ],
    "action_plan": [
      "Bundle cables neatly with zip ties or clips to reduce loops and tangles, following the gold standard setup."
    ],
    "visual_feedback": [
      "Loose loops and tangles visible around the power strip area at the back of the shelf."
    ],
    "notes": ""
  },
  {
    "store": "046",
    "failed_criteria": [
      "Overall Tidy Appearance: Cables should appear reasonably routed. Small loose segments are acceptable as long as there are no large tangles or excessive visual clutter. A simple bundle, clip, or tied group of wires counts as tidy."
    ],
    "action_plan": [
      "Bundle loose cables under the desk using cable ties or clips to reduce tangles and visual clutter, and secure them along the desk frame or wall."
    ],
    "visual_feedback": [
      "Loose cables and power adapters are visibly tangled and lying on the floor beneath the desk, particularly around the power strip."
    ],
    "notes": ""
  },
  {
    "store": "053",
    "failed_criteria": [
      "Overall Tidy Appearance: Cables should appear reasonably routed. Small loose segments are acceptable as long as there are no large tangles or excessive visual clutter.",
      "No Hazardous Dangling: Cables must not extend into walkways, doorways, or foot traffic zones in a way that poses a tripping or obstruction risk."
    ],
    "action_plan": [
      "Bundle and secure cables behind the equipment using clips or zip-ties to eliminate large loops and tangled clusters.",
      "Re-route or secure any cable that crosses or intrudes into the open foot space under the desk to remove tripping hazards."
    ],
    "visual_feedback": [
      "Large cluster of tangled cables with multiple loops visible in the back corner (upper right of the photo).",
      "A loose cable crosses the open foot space at the center-bottom under the desk, posing a tripping risk."
    ],
    "notes": ""
  },
  {
    "store": "057",
    "failed_criteria": [
      "Overall Tidy Appearance"
    ],
    "action_plan": [
      "Bundle cables under the desk using clips or ties to eliminate loose tangles and improve overall neatness."
    ],
    "visual_feedback": [
      "Loose, tangled cables visible under the desk without any bundling or securing."
    ],
    "notes": ""
  },
  {
    "store": "060",
    "failed_criteria": [
      "Overall Tidy Appearance",
      "No Hazardous Dangling"
    ],
    "action_plan": [
      "Bundle and secure loose cables under the desk using clips or ties to improve overall neatness.",
      "Reroute cables to avoid crossing walkways; route them along walls or secure under desk to eliminate trip hazards."
    ],
    "visual_feedback": [
      "Loose white cable lying across the front of desk on the floor is not bundled or secured.",
      "Cable extends into walkable area posing a potential trip hazard."
    ],
    "notes": ""
  },
  {
    "store": "061",
    "failed_criteria": [
      "No Hazardous Dangling"
    ],
    "action_plan": [
      "Secure cables to prevent them from crossing walkways or foot traffic areas; use cable clips or raceways to keep cables off the floor."
    ],
    "visual_feedback": [
      "Cable running across floor under desk in front of cubby poses a tripping hazard."
    ],
    "notes": ""
  },
  {
    "store": "070",
    "failed_criteria": [
      "Overall Tidy Appearance",
      "No Hazardous Dangling"
    ],
    "action_plan": [
      "Bundle and secure cables behind desk using clips or ties to eliminate loose tangles",
      "Route cables along desk edges or walls and elevate them off the floor to remove tripping hazards"
    ],
    "visual_feedback": [
      "Loose and tangled cables visible under the desk behind the PC causing visual clutter",
      "Cables crossing the floor in the foot traffic zone beneath the desk present a potential tripping hazard"
    ],
    "notes": ""
  },
  {
    "store": "072",
    "failed_criteria": [
      "Overall Tidy Appearance: Cables are cluttered and tangled in the cabinet",
      "No Hazardous Dangling: Cable lies across open floor area posing a trip hazard"
    ],
    "action_plan": [
      "Re‐bundle and secure loose cables inside the cabinet using ties or clips to eliminate visual clutter",
      "Remove cables from floor and route them along desk underside or wall with clips, ensuring no cables cross walkways"
    ],
    "visual_feedback": [
      "Tangled, loose cables visible in lower cabinet area behind equipment",
      "Single cable and power strip left on carpet floor under desk crossing foot traffic zone"
    ],
    "notes": ""
  },
  {
    "store": "074",
    "failed_criteria": [
      "Overall Tidy Appearance",
      "No Hazardous Dangling"
    ],
    "action_plan": [
      "Bundle loose cables under the desk using clips or ties to reduce clutter and improve overall neatness.",
      "Secure cables off the floor or route them along the desk frame to eliminate trip hazards and prevent cables from crossing walkways."
    ],
    "visual_feedback": [
      "Loose white cables under the desk form visible loops on the floor beneath the desk shelf, indicating untidy appearance.",
      "A black power cable crosses the open foot traffic zone beneath the desk, posing a tripping hazard."
    ],
    "notes": ""
  },
  {
    "store": "075",
    "failed_criteria": [
      "Overall Tidy Appearance",
      "No Hazardous Dangling"
    ],
    "action_plan": [
      "Bundle and secure all loose cables using clips, zip ties, or cable sleeves to create a tidy routed appearance.",
      "Re-route and fasten cables along desk edges or walls to prevent any cables from crossing foot traffic zones or creating tripping hazards."
    ],
    "visual_feedback": [
      "Loose, unbundled cable loops and power strip cords visible under the desk at floor level in images 9–11.",
      "Mouse and other cables crossing the foot area in image 11, posing a potential tripping risk."
    ],
    "notes": ""
  },
  {
    "store": "084",
    "failed_criteria": [
      "Overall Tidy Appearance",
      "No Hazardous Dangling"
    ],
    "action_plan": [
      "Bundle and clip loose cables behind or under the desk to reduce tangles and visual clutter, using cable ties or clips to secure groups of wires.",
      "Reroute or secure any cable crossing the floor in front of the desk by using cable raceways, cord covers, or fastening them along the baseboard to eliminate trip hazards."
    ],
    "visual_feedback": [
      "Loose and tangled cables are visible under the right side of the desk cabinet, creating excessive visual clutter.",
      "A cable is running across the floor in the open walkway beneath the desk, posing a tripping hazard."
    ],
    "notes": ""
  },
  {
    "store": "087",
    "failed_criteria": [
      "Overall Tidy Appearance"
    ],
    "action_plan": [
      "Rebundle and secure cables behind the desk to eliminate tangled loops, using cable clips or tie wraps to create a neat, single grouped cable run."
    ],
    "visual_feedback": [
      "Tangled cluster of cables visible at top center behind the computer causing excessive clutter."
    ],
    "notes": ""
  },
  {
    "store": "092",
    "failed_criteria": [
      "Overall Tidy Appearance",
      "No Hazardous Dangling"
    ],
    "action_plan": [
      "Bundle and secure loose cables behind or under the desk using cable clips or ties to reduce visual clutter.",
      "Reroute cables away from foot traffic zones by routing them along the edges of the desk or securing them to the underside to eliminate tripping hazards."
    ],
    "visual_feedback": [
      "Loose and tangled cables visible under the desk across the foot path in multiple photos.",
      "Cables looped and scattered on the floor in front of the keyboard tray creating a potential obstruction."
    ],
    "notes": ""
  },
  {
    "store": "096",
    "failed_criteria": [
      "No Hazardous Dangling"
    ],
    "action_plan": [
      "Secure loose cables under desk using cable clips or cable management sleeves to route them along the back or sides, preventing them from crossing the footwell."
    ],
    "visual_feedback": [
      "Loose cables run across the footwell under the desk, crossing open area where staff place feet, posing a trip hazard."
    ],
    "notes": ""
  },
  {
    "store": "098",
    "failed_criteria": [
      "Overall Tidy Appearance"
    ],
    "action_plan": [
      "Rebundle and secure cables into tidy groups with clips or cable ties to eliminate visible tangles and clutter."
    ],
    "visual_feedback": [
      "Visible under-shelf tangle of cables around the surge protector forming an excessive cluster."
    ],
    "notes": ""
  },
  {
    "store": "099",
    "failed_criteria": [
      "No Hazardous Dangling: Cables extend into walkways or foot traffic zones posing a tripping risk"
    ],
    "action_plan": [
      "Secure or reroute the loose cable lying across the floor under the desk: use clips, cable channels, or attach it along the desk frame or baseboard to eliminate trip hazards"
    ],
    "visual_feedback": [
      "Loose power/data cable visible across the carpeted floor under the center of the desk, crossing the walkable area"
    ],
    "notes": ""
  },
  {
    "store": "106",
    "failed_criteria": [
      "Overall Tidy Appearance"
    ],
    "action_plan": [
      "Bundle and secure loose cables using clips or ties to reduce tangles and improve neatness"
    ],
    "visual_feedback": [
      "Loose cables behind equipment appear tangled and unsecured in the timestamped photo."
    ],
    "notes": ""
  },
  {
    "store": "107",
    "failed_criteria": [
      "Overall Tidy Appearance",
      "No Hazardous Dangling"
    ],
    "action_plan": [
      "Organize cables into neat bundles using clips or ties and reroute or secure any tangled or cluttered sections to match the standard.",
      "Ensure cables are routed away from walkways and floor areas; secure loose cables off the floor or use cable covers to eliminate tripping hazards."
    ],
    "visual_feedback": [
      "Tangled cluster of cables visible on the right side of the shelf near the equipment indicates excessive clutter.",
      "Multiple cables and a power strip lying on the floor under the desk creating a potential tripping hazard in the walkway area."
    ],
    "notes": ""
  },
  {
    "store": "108",
    "failed_criteria": [
      "Overall Tidy Appearance",
      "No Hazardous Dangling"
    ],
    "action_plan": [
      "Secure and bundle loose cables using clips or ties to create neat, grouped cable runs.",
      "Reroute and secure any cables crossing walkways by fastening them along desk edges or under mats to eliminate tripping hazards."
    ],
    "visual_feedback": [
      "Tangled and cluttered cables visible behind and under the desk area.",
      "Cable extending across the floor in front of the desk presents a potential trip hazard."
    ],
    "notes": ""
  },
  {
    "store": "109",
    "failed_criteria": [
      "Overall Tidy Appearance",
      "No Hazardous Dangling"
    ],
    "action_plan": [
      "Bundle and secure loose cables using clips, ties, or a cable management tray to reduce visible clutter and loose loops.",
      "Reroute or elevate cables to prevent them from crossing walkways or open areas; use cable raceways or under-desk trays to eliminate tripping hazards."
    ],
    "visual_feedback": [
      "Loose and tangled blue cables visible hanging behind the equipment shelf in the third image.",
      "Cable lying across the floor under the desk in the second image, posing a potential tripping hazard."
    ],
    "notes": ""
  }
]