[
  {
    "store": "002",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor"
    ],
    "action_plan": [
      "Clean up and remove any spills or stains from the floor to eliminate slip hazards."
    ],
    "visual_feedback": [
      "Visible spill/stain on floor near center of walkway."
    ],
    "notes": ""
  },
  {
    "store": "004",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor"
    ],
    "action_plan": [
      "Clean and remove any spills or stains from the floor to eliminate slip hazards."
    ],
    "visual_feedback": [
      "Visible dark stain/spill mark on the carpet in the central walkway area in the timestamped photo."
    ],
    "notes": ""
  },
  {
    "store": "005",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor"
    ],
    "action_plan": [
      "Clean up any spills or stains on the floor to remove slip hazards"
    ],
    "visual_feedback": [
      "Visible dark stain/spill on carpet in the main walking path in second photo"
    ],
    "notes": ""
  },
  {
    "store": "006",
    "failed_criteria": [
      "The central circulation area (the main walking path through the room) is free of any major obstructions or trip hazards.",
      "No loose debris, litter, or spill hazards on the floor.",
      "Workspace surfaces and aisles are clear enough to allow unimpeded passage of one person.",
      "Any necessary equipment storage (e.g. chairs, carts, bins) is neatly stowed out of the main walking zone."
    ],
    "action_plan": [
      "Remove the safe and filing cabinet from the central circulation area and relocate them to a designated storage zone.",
      "Clean up the spill on the carpet and ensure the floor is dry and free of debris.",
      "Rearrange desks and other furniture to maintain a clear, unimpeded walkway for one person.",
      "Stow all equipment (safe, cabinets, bins) neatly against walls or in a storage area outside the main walking zone."
    ],
    "visual_feedback": [
      "Safe and filing cabinet positioned in the middle of the floor obstructing the main pathway (visible in the fourth image).",
      "Visible wet stain/spill on carpet along the main walkway (visible in the second image).",
      "Aisle between desks and safe is too narrow for unimpeded passage (visible in the third image).",
      "Safe and drawers are not stowed against walls and intrude into the primary walking zone (visible in the fourth image)."
    ],
    "notes": ""
  },
  {
    "store": "010",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor."
    ],
    "action_plan": [
      "Clean up any spills on the floor and ensure the area is dry and free of hazards."
    ],
    "visual_feedback": [
      "Spill hazard visible as a dark patch on the carpet near the right side of the main walking path in front of the desks."
    ],
    "notes": ""
  },
  {
    "store": "012",
    "failed_criteria": [
      "Submission photo unreviewable for assessing standard compliance"
    ],
    "action_plan": [
      "Retake photo for D1: Overall Floor & Workspace Clearance: Ensure image is clear, well-lit, correctly framed, and shows the overall floor area including the main walking path and workspace clearance as per policy guidelines."
    ],
    "visual_feedback": [],
    "notes": "Submission photo does not show the central circulation area required to assess standard compliance. ACTION: Escalate for human review due to low confidence."
  },
  {
    "store": "013",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor."
    ],
    "action_plan": [
      "Clean up the spill on the floor to remove the hazard and ensure the area is dry and safe."
    ],
    "visual_feedback": [
      "Visible dark spill/stain on the carpet in the central aisle near the mid-point of the room."
    ],
    "notes": ""
  },
  {
    "store": "017",
    "failed_criteria": [
      "The central circulation area (the main walking path through the room) is free of any major obstructions or trip hazards.",
      "No loose debris, litter, or spill hazards on the floor.",
      "Any necessary equipment storage (e.g. chairs, carts, bins) is neatly stowed out of the main walking zone."
    ],
    "action_plan": [
      "Repair or replace torn carpet to eliminate trip hazards from the main walking path.",
      "Clean and remove any stains or spills from the floor to eliminate slip hazards.",
      "Relocate the safe and water bottles to designated storage areas away from the primary walking zone to ensure unobstructed passage."
    ],
    "visual_feedback": [
      "Visible tear in carpet along central walkway in the third submission photo.",
      "Dark stain/spill hazard on carpet in the fourth submission photo.",
      "Safe positioned in the center aisle between workstations in the fifth submission photo."
    ],
    "notes": ""
  },
  {
    "store": "021",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor."
    ],
    "action_plan": [
      "Clean and remove any visible spills or floor stains. Mop up the spill and ensure the floor is dry and clear of hazards."
    ],
    "visual_feedback": [
      "Visible spill/stain near the right side of the main aisle floor in the second submission photo."
    ],
    "notes": ""
  },
  {
    "store": "022",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor."
    ],
    "action_plan": [
      "Clean up or remove any spill or stain on the floor to eliminate slip hazards."
    ],
    "visual_feedback": [
      "Visible dark stain or spill hazard on the carpet near the desks, as seen in the second submission image."
    ],
    "notes": ""
  },
  {
    "store": "024",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor."
    ],
    "action_plan": [
      "Clean and remove any spills or stains from the floor to eliminate slip hazards."
    ],
    "visual_feedback": [
      "Visible spill/stain on the floor in the main walking area near the desks."
    ],
    "notes": ""
  },
  {
    "store": "026",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor"
    ],
    "action_plan": [
      "Clean up and remove any spills or stains on the floor; ensure the floor is dry and free of debris."
    ],
    "visual_feedback": [
      "Dark stain/spill hazard visible on the carpet near the center of the walkway."
    ],
    "notes": ""
  },
  {
    "store": "027",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor",
      "Any necessary equipment storage (e.g. chairs, carts, bins) is neatly stowed out of the main walking zone"
    ],
    "action_plan": [
      "Clean and dry the floor to remove any spills or stains to eliminate slip hazards",
      "Relocate the coat rack and hangers out of the main walking path to maintain an unobstructed central circulation area"
    ],
    "visual_feedback": [
      "Visible spill/stain on the carpeted floor in the center of the second image",
      "Coat rack with hangers positioned within the main walking zone in the fourth image"
    ],
    "notes": ""
  },
  {
    "store": "030",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor"
    ],
    "action_plan": [
      "Clean and remove all spills or stains from the floor to ensure no slip hazards remain"
    ],
    "visual_feedback": [
      "Visible spill/stain hazard on the carpeted area near the center-right of the workspace in the second image"
    ],
    "notes": ""
  },
  {
    "store": "033",
    "failed_criteria": [
      "The central circulation area (the main walking path through the room) is free of any major obstructions or trip hazards.",
      "No loose debris, litter, or spill hazards on the floor."
    ],
    "action_plan": [
      "Secure or reroute the cable along the wall or under a cable cover to eliminate trip hazards in the main walking path.",
      "Clean and remove any spills or stains from the floor to ensure no slip or trip hazards remain."
    ],
    "visual_feedback": [
      "A cable is visibly running across the floor from the right-side desk toward the wall in the photo timestamped 2025/05/16 12:30:35, intruding into the primary open space.",
      "A dark stain or possible spill is visible near the center of the room in the photo timestamped 2025/05/16 12:30:35."
    ],
    "notes": ""
  },
  {
    "store": "037",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor."
    ],
    "action_plan": [
      "Clean up the spill hazard on the floor in the central circulation area and ensure it is fully dry and free of debris."
    ],
    "visual_feedback": [
      "Dark spot/spill-like stain visible on the floor in the central aisle area."
    ],
    "notes": ""
  },
  {
    "store": "038",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor."
    ],
    "action_plan": [
      "Clean and remove any spills or stains from the floor before resubmission."
    ],
    "visual_feedback": [
      "Visible spill or stain on the carpet near the front right side, posing a trip or slip hazard."
    ],
    "notes": ""
  },
  {
    "store": "039",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor."
    ],
    "action_plan": [
      "Clean any spills or remove any debris from the floor to eliminate hazards."
    ],
    "visual_feedback": [
      "Visible spill/stain on the floor near the center of the workspace in the second image indicating a slip hazard."
    ],
    "notes": ""
  },
  {
    "store": "040",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor"
    ],
    "action_plan": [
      "Clean up all visible spills or debris on the floor and retake the photo showing a completely dry, hazard-free central walking area"
    ],
    "visual_feedback": [
      "Visible dark patch/spill hazard on the floor center-left in the timestamped image (2025/05/15 11:36:14)"
    ],
    "notes": ""
  },
  {
    "store": "041",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor."
    ],
    "action_plan": [
      "Clean up and remove any spills or wet areas on the floor to eliminate slip hazards."
    ],
    "visual_feedback": [
      "Visible spill/stain on the floor in the central aisle near the desks (see timestamped submission photo)."
    ],
    "notes": ""
  },
  {
    "store": "042",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor."
    ],
    "action_plan": [
      "Clean and remove the visible stain/spill from the carpet to eliminate slip or trip hazards."
    ],
    "visual_feedback": [
      "Visible carpet stain/spill hazard near the central walkway in the third submission image (timestamped 2025/05/15 11:53:05)."
    ],
    "notes": ""
  },
  {
    "store": "045",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor.",
      "Any necessary equipment storage (e.g. chairs, carts, bins) is neatly stowed out of the main walking zone."
    ],
    "action_plan": [
      "Clean and remove any visible spill hazards from the floor to eliminate slip risks.",
      "Relocate the coat rack and any equipment storage completely out of the main walking zone."
    ],
    "visual_feedback": [
      "Visible spill/stain near the center aisle in second submission photo.",
      "Coat rack blocking the central circulation area in second submission photo."
    ],
    "notes": ""
  },
  {
    "store": "047",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor"
    ],
    "action_plan": [
      "Clean and remove the spill hazard: Wipe and sanitize the stained area to eliminate any spill hazards before resubmitting the photo."
    ],
    "visual_feedback": [
      "Visible spill stain on carpet in the main walkway area in the second submission image."
    ],
    "notes": ""
  },
  {
    "store": "049",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor."
    ],
    "action_plan": [
      "Clean up any spills and ensure the floor is completely dry and free of stains, then retake the photo to display a clear surface."
    ],
    "visual_feedback": [
      "Spill or stain visible on floor in the central aisle near the desks."
    ],
    "notes": ""
  },
  {
    "store": "052",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor"
    ],
    "action_plan": [
      "Clean up any spills or stains on the floor before retaking the photo to ensure the floor is dry and free of hazards."
    ],
    "visual_feedback": [
      "Spill/stain visible on the floor near the center of the corridor in the second submission image."
    ],
    "notes": ""
  },
  {
    "store": "055",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor."
    ],
    "action_plan": [
      "Remove any spill or stain from the carpet immediately to eliminate slip hazards."
    ],
    "visual_feedback": [
      "Dark patch/spill visible on the carpet near the desks in the main aisle."
    ],
    "notes": ""
  },
  {
    "store": "058",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor."
    ],
    "action_plan": [
      "Clean up any spills or stains on the floor to remove slip/trip hazards."
    ],
    "visual_feedback": [
      "Spill/stain visible on the carpet in the main walkway area in the second submission image."
    ],
    "notes": ""
  },
  {
    "store": "060",
    "failed_criteria": [
      "The central circulation area (the main walking path through the room) is free of any major obstructions or trip hazards.",
      "No loose debris, litter, or spill hazards on the floor.",
      "Any necessary equipment storage (e.g. chairs, carts, bins) is neatly stowed out of the main walking zone."
    ],
    "action_plan": [
      "Remove or relocate boxes from the main walking path to free the central circulation area.",
      "Clean and remove the spill or stain on the floor to eliminate slip hazards.",
      "Reorganize and store equipment and boxes outside the main walking zone, ensuring aisles remain clear."
    ],
    "visual_feedback": [
      "Boxes stacked on the left side intruding into the main walkway.",
      "Visible spill/stain on the carpet near the center of the pathway.",
      "Coats and boxes near the door encroaching the walking zone."
    ],
    "notes": ""
  },
  {
    "store": "062",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor."
    ],
    "action_plan": [
      "Clean or remove the spill/stain from the floor to eliminate slip hazard."
    ],
    "visual_feedback": [
      "Visible spill/stain hazard near center bottom area in submission photo."
    ],
    "notes": ""
  },
  {
    "store": "066",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor"
    ],
    "action_plan": [
      "Clean up the spill and ensure the floor is dry and free of hazards before submitting photo"
    ],
    "visual_feedback": [
      "Visible wet patch/spill hazard on the carpeted area near the desks in the second submission photo"
    ],
    "notes": ""
  },
  {
    "store": "068",
    "failed_criteria": [
      "The central circulation area (the main walking path through the room) is free of any major obstructions or trip hazards.",
      "No loose debris, litter, or spill hazards on the floor."
    ],
    "action_plan": [
      "Secure or route cables and cords away from the main walking path using cable management solutions.",
      "Clean up and remove any spills or stains from the floor to eliminate slip hazards."
    ],
    "visual_feedback": [
      "Exposed cable under the desk intruding into the walking area (visible in the fourth submission image).",
      "Stain or spill mark on the carpet near the central aisle (visible in the second submission image)."
    ],
    "notes": ""
  },
  {
    "store": "072",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor."
    ],
    "action_plan": [
      "Clean up and properly dry the spill on the floor to eliminate slip hazards."
    ],
    "visual_feedback": [
      "Visible spill on the carpet near the desks in the center aisle."
    ],
    "notes": ""
  },
  {
    "store": "074",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor."
    ],
    "action_plan": [
      "Clean up the spill and dry the floor to eliminate slip hazards."
    ],
    "visual_feedback": [
      "Image 2: Visible stain/spill on the floor in the central walking path near the desks."
    ],
    "notes": ""
  },
  {
    "store": "080",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor."
    ],
    "action_plan": [
      "Clean up and remove any spills or stains from the floor. Wipe and dry the area to eliminate slip hazards."
    ],
    "visual_feedback": [
      "Dark stain/spill visible on the carpet near the center front area in the submission photo."
    ],
    "notes": ""
  },
  {
    "store": "083",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor."
    ],
    "action_plan": [
      "Clean up the spill and ensure the floor is dry and free of hazards."
    ],
    "visual_feedback": [
      "Dark stain/spill hazard visible on the floor near the right-side desk area."
    ],
    "notes": ""
  },
  {
    "store": "087",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor."
    ],
    "action_plan": [
      "Clean up any spills and remove debris from the floor before re-photographing."
    ],
    "visual_feedback": [
      "Dark stains/spill marks visible on the carpet near the right desk area."
    ],
    "notes": ""
  },
  {
    "store": "089",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor."
    ],
    "action_plan": [
      "Clean up any spills or stains on the floor to eliminate slip hazards."
    ],
    "visual_feedback": [
      "Spill/stain visible on the carpeted main walkway near the center of the photo."
    ],
    "notes": ""
  },
  {
    "store": "090",
    "failed_criteria": [
      "The central circulation area (the main walking path through the room) is free of any major obstructions or trip hazards.",
      "Workspace surfaces and aisles are clear enough to allow unimpeded passage of one person.",
      "Any necessary equipment storage (e.g. chairs, carts, bins) is neatly stowed out of the main walking zone."
    ],
    "action_plan": [
      "Remove the ladder from the central walking path and store it in the designated storage area.",
      "Re-arrange workspace aisles to ensure unimpeded passage; clear any obstructions from the main walkway.",
      "Stow equipment such as ladders and bins completely out of the main walking zone."
    ],
    "visual_feedback": [
      "Ladder intruding into the central walkway on the right side of the image.",
      "Workspace aisle partially blocked by ladder; obstructs unimpeded passage.",
      "Ladder not stowed and intruding into main walking zone."
    ],
    "notes": ""
  },
  {
    "store": "091",
    "failed_criteria": [
      "The central circulation area (the main walking path through the room) is free of any major obstructions or trip hazards.",
      "No loose debris, litter, or spill hazards on the floor.",
      "Workspace surfaces and aisles are clear enough to allow unimpeded passage of one person.",
      "Any necessary equipment storage (e.g. chairs, carts, bins) is neatly stowed out of the main walking zone."
    ],
    "action_plan": [
      "Remove the ladder and safe from the central walkway to clear the main circulation path.",
      "Clean up the visible spill stain on the floor and ensure no loose debris or litter remains.",
      "Relocate boxes and equipment from aisles to provide unobstructed passage for one person.",
      "Store the ladder and any other equipment neatly out of the primary walking zone."
    ],
    "visual_feedback": [
      "Ladder and safe positioned in the center aisle obstructing the main walking path.",
      "Visible spill stain on the carpet near the center of the workspace.",
      "Stacks of boxes and equipment placed along the back aisle narrowing the passage.",
      "Ladder left standing in the main walking zone instead of being stowed."
    ],
    "notes": ""
  },
  {
    "store": "092",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor"
    ],
    "action_plan": [
      "Clean up any spills or marks on the floor immediately to remove slip hazards."
    ],
    "visual_feedback": [
      "Visible stain/spill hazard on the floor near the center right of the walkway in the second submission photo."
    ],
    "notes": ""
  },
  {
    "store": "093",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor."
    ],
    "action_plan": [
      "Clean and dry the spill on the floor to eliminate any slip hazard."
    ],
    "visual_feedback": [
      "Dark stain/spill visible near the center of the carpeted floor in the first submission photo."
    ],
    "notes": ""
  },
  {
    "store": "096",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor"
    ],
    "action_plan": [
      "Clean up and remove the visible spill/stain on the floor to eliminate trip and slip hazards in the main walking path."
    ],
    "visual_feedback": [
      "Visible spill/stain hazard on the carpet near the center aisle in multiple photos (e.g., near the desks and safe area)."
    ],
    "notes": ""
  },
  {
    "store": "098",
    "failed_criteria": [
      "The central circulation area (the main walking path through the room) is free of any major obstructions or trip hazards.",
      "No loose debris, litter, or spill hazards on the floor.",
      "Any necessary equipment storage (e.g. chairs, carts, bins) is neatly stowed out of the main walking zone."
    ],
    "action_plan": [
      "Relocate the portable fan and dehumidifier away from the main walking path and store them against the wall or under a desk.",
      "Clean up or remove the visible spill/stain on the carpet immediately.",
      "Ensure all equipment is neatly stowed out of the primary open space to maintain unobstructed walkways."
    ],
    "visual_feedback": [
      "The portable fan and dehumidifier appear partially intruding into the central walkway (visible in the 3rd and 4th images).",
      "A spill or stain is visible on the carpet in the center of the aisle (4th image)."
    ],
    "notes": ""
  },
  {
    "store": "101",
    "failed_criteria": [
      "The central circulation area (the main walking path through the room) is free of any major obstructions or trip hazards.",
      "No loose debris, litter, or spill hazards on the floor."
    ],
    "action_plan": [
      "Relocate the chair intruding into the primary open space back against the wall or under a desk.",
      "Clean and dry the visible spill/stain on the floor immediately to eliminate slip hazards."
    ],
    "visual_feedback": [
      "A desk chair is positioned in the center of the room, blocking the main walking path.",
      "There is a visible wet spot or stain on the carpet near the middle of the circulation area."
    ],
    "notes": ""
  },
  {
    "store": "107",
    "failed_criteria": [
      "The central circulation area (the main walking path through the room) is free of any major obstructions or trip hazards.",
      "No loose debris, litter, or spill hazards on the floor.",
      "Workspace surfaces and aisles are clear enough to allow unimpeded passage of one person.",
      "Any necessary equipment storage (e.g. chairs, carts, bins) is neatly stowed out of the main walking zone."
    ],
    "action_plan": [
      "Remove the stacks of boxes and safe from the central walking path to clear obstructions.",
      "Clean up and dry the visible floor stain to eliminate the spill hazard.",
      "Reorganize items and ensure aisles are free of intrusions to allow unimpeded passage.",
      "Store equipment and boxes neatly against walls or in designated storage areas outside of the main walking zone."
    ],
    "visual_feedback": [
      "Stacks of boxes and a large safe placed in the center space blocking the main path.",
      "Visible carpet stain near the desks indicating a spill hazard.",
      "Boxes and safe intruding into the aisle space preventing clear one-person passage.",
      "Boxes are stacked in the open area rather than stored against walls or designated zones."
    ],
    "notes": ""
  },
  {
    "store": "110",
    "failed_criteria": [
      "No loose debris, litter, or spill hazards on the floor."
    ],
    "action_plan": [
      "Clean and dry any spill or wet spots on the floor to eliminate slip hazards."
    ],
    "visual_feedback": [
      "Visible wet stain/spill hazard near front center of the carpet in the submission photo."
    ],
    "notes": ""
  }
]