[
  {
    "store": "004",
    "failed_criteria": [
      "Stacking neatness: Boxes must be stacked squarely and tightly with no loose, toppled, or haphazard piles",
      "Aisle/storage-area clearance: In a dedicated storage room, there must be enough space to walk safely; current piles obstruct normal access"
    ],
    "action_plan": [
      "Restack boxes so they are squarely and tightly aligned with no unstable or leaning piles",
      "Reconfigure or relocate boxes to create a clear, sensible foot-path for safe walking access in the storage area"
    ],
    "visual_feedback": [
      "Top-left and central boxes are leaning and partially toppled, indicating unstable stacking",
      "Boxes fill the floor area completely on the left side, leaving no clear walkway for safe access"
    ],
    "notes": ""
  },
  {
    "store": "010",
    "failed_criteria": [
      "Aisle/storage-area clearance"
    ],
    "action_plan": [
      "Remove stacked chairs from in front of storage boxes to maintain a clear foot path in the storage room."
    ],
    "visual_feedback": [
      "Stacked chairs are blocking the walkway in front of the boxes, obstructing safe access."
    ],
    "notes": ""
  },
  {
    "store": "013",
    "failed_criteria": [
      "Boxes must be stacked squarely and tightly with no loose, toppled, or haphazard piles."
    ],
    "action_plan": [
      "Re-stack boxes squarely and tightly, ensuring no loose, toppled, or haphazard piles; realign any leaning boxes."
    ],
    "visual_feedback": [
      "Top right stack shows boxes leaning at an angle, indicating an unstable, haphazard pile."
    ],
    "notes": ""
  },
  {
    "store": "014",
    "failed_criteria": [
      "Stacking neatness: Boxes must be stacked squarely and tightly with no loose, toppled, or haphazard piles.",
      "Aisle/storage-area clearance: In a dedicated storage room, you only need enough space to walk safely—no need for a full “aisle” like in a retail area."
    ],
    "action_plan": [
      "Restack boxes so that they are squarely aligned and stable with no loose, toppled, or haphazard piles.",
      "Rearrange boxes to ensure a clear, unobstructed walking path in the storage area."
    ],
    "visual_feedback": [
      "Middle-left section shows unevenly aligned boxes with partially open lids leading to unstable stacking.",
      "Right side of the room is filled end-to-end with boxes, leaving no sensible foot-path for safe access."
    ],
    "notes": ""
  },
  {
    "store": "024",
    "failed_criteria": [
      "Stacking neatness: Boxes must be stacked squarely and tightly with no loose, toppled, or haphazard piles."
    ],
    "action_plan": [
      "Re-stack boxes so they are squarely aligned and tightly stacked; eliminate loose or leaning piles to ensure stability."
    ],
    "visual_feedback": [
      "Boxes in the top of the right column are leaning and appear unstable with lids ajar."
    ],
    "notes": ""
  },
  {
    "store": "031",
    "failed_criteria": [
      "Aisle/storage-area clearance obstructs access"
    ],
    "action_plan": [
      "Reorganize storage boxes to allow a clear walking path to access stored items without obstruction."
    ],
    "visual_feedback": [
      "Boxes stacked densely with no visible foot-path, blocking door and hindering safe access."
    ],
    "notes": ""
  },
  {
    "store": "033",
    "failed_criteria": [
      "Aisle/storage-area clearance"
    ],
    "action_plan": [
      "Clear a safe walkway by moving boxes off the center of the storage room floor and placing them against walls or on shelving to allow unobstructed foot traffic."
    ],
    "visual_feedback": [
      "Boxes are stacked across the floor with no visible clear path for walking."
    ],
    "notes": ""
  },
  {
    "store": "043",
    "failed_criteria": [
      "Boxes must be stacked squarely and tightly with no loose, toppled, or haphazard piles.",
      "Aisle/storage-area clearance insufficient - obstructing normal access."
    ],
    "action_plan": [
      "Restack boxes in neat, square piles with no overhanging or tilted boxes.",
      "Reconfigure storage layout to create a clear foot-path for normal access."
    ],
    "visual_feedback": [
      "Top-left stacks show overhanging and tilted boxes indicating unstable stacking.",
      "No clear aisle between left and right stacks; access is obstructed by tightly packed boxes."
    ],
    "notes": ""
  },
  {
    "store": "046",
    "failed_criteria": [
      "Boxes must be stacked squarely and tightly with no loose, toppled, or haphazard piles.",
      "Aisle/storage-area clearance: boxes obstruct normal access."
    ],
    "action_plan": [
      "Re-stack boxes to ensure they are squarely and tightly stacked with no loose or toppled piles.",
      "Reorganize storage area to create a clear foot-path for safe access, ensuring boxes do not obstruct the walking space."
    ],
    "visual_feedback": [
      "The stacks on the right side are leaning and uneven, indicating unstable piles.",
      "The floor area is fully occupied by boxes, leaving no room for a safe walking path."
    ],
    "notes": ""
  },
  {
    "store": "047",
    "failed_criteria": [
      "Stacking neatness: Boxes must be stacked squarely and tightly with no loose, toppled, or haphazard piles."
    ],
    "action_plan": [
      "Re-stack boxes neatly, aligning edges squarely and tightly to remove loose or uneven piles."
    ],
    "visual_feedback": [
      "Top row boxes are uneven and leaning, showing loose and haphazard stacking in the upper section of the pile."
    ],
    "notes": ""
  },
  {
    "store": "055",
    "failed_criteria": [
      "Boxes must be stacked squarely and tightly with no loose, toppled, or haphazard piles."
    ],
    "action_plan": [
      "Re-stack boxes so they are squarely aligned and tightly stacked without overhang or instability."
    ],
    "visual_feedback": [
      "The top box is misaligned and overhangs the box below on the right side, indicating unstable stacking."
    ],
    "notes": ""
  },
  {
    "store": "057",
    "failed_criteria": [
      "Stacking neatness: Boxes must be stacked squarely and tightly with no loose, toppled, or haphazard piles."
    ],
    "action_plan": [
      "Restack boxes so that they are squarely aligned and tightly stacked, eliminating any leaning or uneven piles to ensure stability."
    ],
    "visual_feedback": [
      "Middle-left stack shows boxes leaning and uneven alignment, indicating unstable piles."
    ],
    "notes": ""
  },
  {
    "store": "075",
    "failed_criteria": [
      "Aisle/storage-area clearance"
    ],
    "action_plan": [
      "Reorganize boxes to create a clear foot-path: ensure boxes are not blocking access and allow safe walking space in storage room."
    ],
    "visual_feedback": [
      "No clear walkway visible; boxes cover the entire floor area from wall to wall, preventing safe access."
    ],
    "notes": ""
  },
  {
    "store": "101",
    "failed_criteria": [
      "Aisle/storage-area clearance: Boxes obstruct the normal access path in the storage area"
    ],
    "action_plan": [
      "Reorganize boxes to create a clear footpath in the storage room, ensuring safe and unobstructed access as per guidelines."
    ],
    "visual_feedback": [
      "Large box in the foreground blocks the walkway, leaving insufficient space for safe passage."
    ],
    "notes": ""
  },
  {
    "store": "102",
    "failed_criteria": [
      "Stacking neatness: Boxes are not stacked squarely and tightly; several piles are leaning or have open flaps",
      "Aisle/storage-area clearance: No clear foot-path visible; boxes obstruct safe access"
    ],
    "action_plan": [
      "Restack boxes squarely and tightly, ensuring all flaps are closed and no piles are leaning",
      "Reorganize storage area to create a clear walkway for safe access"
    ],
    "visual_feedback": [
      "Visible leaning and open-flap boxes on the right side indicating unstable stacking",
      "Boxes covering the floor area at the front with no clear aisle for walking"
    ],
    "notes": ""
  },
  {
    "store": "106",
    "failed_criteria": [
      "Aisle/storage-area clearance"
    ],
    "action_plan": [
      "Reorganize boxes to provide a clear foot-path: push boxes tightly against the wall or shelving and ensure unobstructed aisle clearance for safe access."
    ],
    "visual_feedback": [
      "The boxes stacked alongside the cubicle partition block the walkway, leaving insufficient clearance for safe foot traffic."
    ],
    "notes": ""
  }
]