[
  {
    "store": "015",
    "failed_criteria": [
      "Shelves appear generally tidy and orderly: Documents may lean slightly or vary in height, but no piles are spilling out or uncontained."
    ],
    "action_plan": [
      "Re-stack and secure document piles so that no papers lean out or spill beyond the shelf edges; ensure all files are fully contained within the shelves."
    ],
    "visual_feedback": [
      "Bottom left and bottom right shelves have piles leaning out and partially spilling beyond the shelf edge."
    ],
    "notes": ""
  },
  {
    "store": "047",
    "failed_criteria": [
      "Shelves appear generally tidy and orderly: Documents may lean slightly or vary in height, but no piles are spilling out or uncontained."
    ],
    "action_plan": [
      "Reorganize bottom shelf files to ensure no piles are spilling out: neatly gather or re-shelve the red file sleeves so that all documents are fully contained within the shelf."
    ],
    "visual_feedback": [
      "Bottom left and right shelf sections show red file sleeves spilling out and uncontained on the lower shelves."
    ],
    "notes": ""
  },
  {
    "store": "049",
    "failed_criteria": [
      "Shelves appear generally tidy and orderly",
      "Shelves should only contain files and essential office-related items"
    ],
    "action_plan": [
      "Rearrange shelf contents to eliminate uncontained document piles and ensure documents are neatly aligned without overstuffing",
      "Remove or properly store loose paper stacks and non-essential items from shelves, keeping only files and essential office supplies"
    ],
    "visual_feedback": [
      "Uncontained stacks of loose papers visible on the bottom right shelf",
      "Overstuffed documents leaning out on the bottom left shelf"
    ],
    "notes": ""
  },
  {
    "store": "064",
    "failed_criteria": [
      "Shelves contain non-document items"
    ],
    "action_plan": [
      "Remove all non-document items (e.g., microwave, mugs, paper towel roll) from the shelving unit and relocate them to an appropriate break area so that shelves contain only files and essential office-related items."
    ],
    "visual_feedback": [
      "Non-document items (microwave, mugs, paper towel roll) visible on bottom right shelf."
    ],
    "notes": ""
  },
  {
    "store": "066",
    "failed_criteria": [
      "Shelves appear generally tidy and orderly: Documents may lean slightly or vary in height, but no piles are spilling out or uncontained."
    ],
    "action_plan": [
      "Reorganize or remove excess documents to reduce overcrowding. Arrange files neatly on each shelf compartment so that no documents lean excessively or spill outward."
    ],
    "visual_feedback": [
      "Overfilled shelf compartments with papers bulging and leaning out of the cubbies, particularly in the leftmost and rightmost sections."
    ],
    "notes": ""
  },
  {
    "store": "072",
    "failed_criteria": [
      "Shelves should only contain files and essential office-related items"
    ],
    "action_plan": [
      "Remove non-essential items (e.g., the stuffed toy on the top right shelf) so that only files and essential office supplies remain"
    ],
    "visual_feedback": [
      "Non-essential stuffed toy located on the top right shelf"
    ],
    "notes": ""
  },
  {
    "store": "075",
    "failed_criteria": [
      "Shelves appear generally tidy and orderly: no piles spilling out or uncontained"
    ],
    "action_plan": [
      "Reorganize loose papers on bottom right shelf: file documents into folders or binders to eliminate uncontained piles."
    ],
    "visual_feedback": [
      "Bottom right section of shelving has a stack of uncontained loose papers visibly spilling out."
    ],
    "notes": ""
  },
  {
    "store": "090",
    "failed_criteria": [
      "All documents are stored on shelves (no loose paper stacks on desks or the floor)"
    ],
    "action_plan": [
      "Remove any loose papers from desks or the floor and store all documents securely on the shelves."
    ],
    "visual_feedback": [
      "Loose papers visible on the desk/counter to the left of the cabinet."
    ],
    "notes": ""
  },
  {
    "store": "100",
    "failed_criteria": [
      "All documents are stored on shelves (no loose paper stacks on desks or the floor).",
      "Shelves appear generally tidy and orderly: Documents may lean slightly or vary in height, but no piles are spilling out or uncontained."
    ],
    "action_plan": [
      "Remove all loose papers from the floor; place them properly on the shelves in labeled visible folders or holders.",
      "Reorganize shelves to ensure documents are neat and contained: realign leaning files and eliminate uncontained piles."
    ],
    "visual_feedback": [
      "Bottom right of the shelving unit shows a loose stack of documents on the floor.",
      "Top right shelf has a large, uncontained pile of leaning documents spilling toward the front."
    ],
    "notes": ""
  },
  {
    "store": "101",
    "failed_criteria": [
      "All documents are stored on shelves (no loose paper stacks on desks or the floor)"
    ],
    "action_plan": [
      "Remove any loose documents from the floor or desks and store them properly on shelves."
    ],
    "visual_feedback": [
      "Loose stack of papers visible on the floor at the bottom right next to the white cabinet."
    ],
    "notes": ""
  },
  {
    "store": "108",
    "failed_criteria": [
      "Shelves appear generally tidy and orderly: piles are spilling out or uncontained."
    ],
    "action_plan": [
      "Reorganize the shelves to ensure no papers or binders are spilling out; neatly contain all files within each shelf compartment."
    ],
    "visual_feedback": [
      "Fourth shelf down on the left side shows loose papers and a binder spilling out and uncontained."
    ],
    "notes": ""
  },
  {
    "store": "110",
    "failed_criteria": [
      "All documents are stored on shelves (no loose paper stacks on desks or the floor)"
    ],
    "action_plan": [
      "Move all document storage boxes from the floor onto shelves or into proper storage units."
    ],
    "visual_feedback": [
      "Boxes labeled \"December 2024 Reports and Contracts\", \"November 2024 Reports and Contracts\", and \"September & October 2023 Contracts\" are visible on the floor next to the shelving unit."
    ],
    "notes": ""
  }
]