[
  {
    "store": "005",
    "failed_criteria": [
      "Shelves may mix cleaning supplies with office items (pens, flashlights, stationery) only if they are grouped by level."
    ],
    "action_plan": [
      "Ensure that shelves are reorganized so that cleaning supplies and office items are separated by shelf level; move all office-related items to a dedicated shelf."
    ],
    "visual_feedback": [
      "Shelf 3 from the top shows office items (pen organizer and notebooks) adjacent to cleaning chemicals (spray bottles) on the same shelf level."
    ],
    "notes": ""
  },
  {
    "store": "013",
    "failed_criteria": [
      "Shelves mix cleaning supplies with office items on the same shelf (not grouped by level)",
      "Personal or unrelated clutter mixed with cleaning supplies"
    ],
    "action_plan": [
      "Separate cleaning supplies and office items onto different shelves so that each shelf contains only one category of items",
      "Remove personal or unrelated items (e.g., power cords, electronics) from the cleaning supplies cabinet"
    ],
    "visual_feedback": [
      "Image 3: Top shelf shows cleaning sprays stored alongside pens and stationery, violating shelf-level grouping requirement",
      "Image 3: Bottom shelf contains power cords and electronic accessories mixed with cleaning supplies"
    ],
    "notes": ""
  },
  {
    "store": "015",
    "failed_criteria": [
      "Submission photo unreviewable for assessing standard compliance"
    ],
    "action_plan": [
      "Retake photo for D5: Cleaning Supplies & Cabinet Organization: Ensure image is clear, well-lit, correctly framed, and accurately shows the designated cleaning supplies cabinet with shelves stocked in an organized manner as per policy guidelines."
    ],
    "visual_feedback": [],
    "notes": "Incorrect photo submitted for D5: Cleaning Supplies & Cabinet Organization; expected view of cleaning supplies cabinet, received mail sorter-style compartments. ACTION: Escalate for human review due to low confidence."
  },
  {
    "store": "021",
    "failed_criteria": [
      "Shelves may mix cleaning supplies with office items (pens, flashlights, stationery) only if they are grouped by level",
      "No personal or unrelated clutter (e.g. snacks, decorative items) mixed in with cleaning supplies."
    ],
    "action_plan": [
      "Group cleaning supplies and non-cleaning items by shelf level: place all cleaning chemicals on dedicated shelves and relocate office or other items to separate shelves.",
      "Remove all personal or unrelated items (e.g. bags, electronics packaging) from the cleaning supplies cabinet."
    ],
    "visual_feedback": [
      "Second photo, middle shelf: Cleaning chemicals and office/electronic items appear on the same shelf rather than being grouped separately.",
      "Second photo, right column: A red personal bag and electronic device boxes are visible among cleaning supplies, constituting unrelated clutter."
    ],
    "notes": ""
  },
  {
    "store": "030",
    "failed_criteria": [
      "Shelves may mix cleaning supplies with office items (pens, flashlights, stationery) only if they are grouped by level",
      "No personal or unrelated clutter (e.g. snacks, decorative items) mixed in with cleaning supplies"
    ],
    "action_plan": [
      "Ensure all cleaning supplies and non-cleaning items are stored on separate shelves with no mixing on the same level",
      "Remove any personal or unrelated items (e.g., bags) from the cleaning supplies cabinet to avoid clutter"
    ],
    "visual_feedback": [
      "Bottom shelf: Personal bag placed alongside cleaning chemicals, indicating mixed items on one shelf",
      "Multiple shelves show mixed items (boxes, stationery) not grouped by level"
    ],
    "notes": ""
  },
  {
    "store": "033",
    "failed_criteria": [
      "Shelves may mix cleaning supplies with office items (pens, flashlights, stationery) only if they are grouped by level",
      "No personal or unrelated clutter (e.g. snacks, decorative items) mixed in with cleaning supplies"
    ],
    "action_plan": [
      "Ensure all non-cleaning items are stored separately on their own shelf levels; reorganize so that cleaning supplies and office items are not on the same shelf",
      "Remove personal or unrelated items (e.g., cables, keyboard) from the cleaning supplies cabinet"
    ],
    "visual_feedback": [
      "Upper-right compartment: cleaning spray stored alongside cables and a keyboard on the same level",
      "Center-right compartment: tool bags placed next to cleaning chemicals instead of on a separate shelf"
    ],
    "notes": ""
  },
  {
    "store": "039",
    "failed_criteria": [
      "Shelves may mix cleaning supplies with office items (pens, flashlights, stationery) only if they are grouped by level."
    ],
    "action_plan": [
      "Ensure that shelves are reorganized so that cleaning supplies and office items are separated by shelf level; move all office-related items to a dedicated shelf."
    ],
    "visual_feedback": [
      "Shelf 3 from the top shows office items (pen organizer and notebooks) adjacent to cleaning chemicals (spray bottles) on the same shelf level."
    ],
    "notes": ""
  },
  {
    "store": "040",
    "failed_criteria": [
      "Shelves mix cleaning supplies with office items on the same level",
      "Personal or unrelated clutter mixed in with cleaning supplies"
    ],
    "action_plan": [
      "Reorganize shelves so that cleaning supplies and office items are on separate levels; dedicate each shelf level exclusively to cleaning or office items.",
      "Remove all personal or unrelated items from the cleaning supplies cabinet."
    ],
    "visual_feedback": [
      "Top shelf: chemical sprays and office items (red container, phone) appear on same shelf level.",
      "Bottom right compartments contain electronic devices and cables unrelated to cleaning supplies."
    ],
    "notes": ""
  },
  {
    "store": "043",
    "failed_criteria": [
      "At least one image must clearly show the designated cleaning supplies cabinet, with shelves visibly stocked in a reasonably organized manner.",
      "All cleaning supplies and related chemicals are stored inside the designated cabinet.",
      "No personal or unrelated clutter (e.g. snacks, decorative items) mixed in with cleaning supplies."
    ],
    "action_plan": [
      "Retake photo showing the designated cleaning supplies cabinet with shelves stocked in cleaning supplies and chemicals as per guidelines.",
      "Ensure all cleaning supplies and related chemicals are stored inside the designated cabinet and not mixed with office or unrelated items.",
      "Remove personal or unrelated items from the cabinet before photographing to eliminate clutter."
    ],
    "visual_feedback": [
      "Cabinet shelves contain boxes of office supplies (e.g., Pendaflex boxes, scanner equipment) instead of cleaning products.",
      "No visible cleaning chemicals or supplies present in the photographed cabinet.",
      "Multiple shelves show non-cleaning items and general clutter that do not belong in the cleaning supplies cabinet."
    ],
    "notes": ""
  },
  {
    "store": "050",
    "failed_criteria": [
      "Shelves mixing cleaning supplies with office items on the same level"
    ],
    "action_plan": [
      "Separate cleaning supplies and office items by shelf: move either the staples or the garbage bags from their shared shelf so each shelf contains only cleaning or only office items."
    ],
    "visual_feedback": [
      "Third shelf: garbage bags and staples box are placed together, mixing cleaning and office supplies on the same shelf."
    ],
    "notes": ""
  },
  {
    "store": "056",
    "failed_criteria": [
      "Shelves mix cleaning supplies with office items on the same shelf level"
    ],
    "action_plan": [
      "Reorganize shelves so that each shelf level contains only cleaning supplies or only office items, ensuring no mixing on the same level"
    ],
    "visual_feedback": [
      "Top shelf shows cleaning chemical jugs mixed with storage boxes on the same shelf level"
    ],
    "notes": ""
  },
  {
    "store": "058",
    "failed_criteria": [
      "Shelves may mix cleaning supplies with office items (pens, flashlights, stationery) **only if** they are grouped by level: • It’s fine to have non-cleaning items on one shelf and cleaning chemicals on another—no need to purge all mixed levels.  • Ignore individual bottle spacing or overlap as long as each shelf looks generally tidy.",
      "No personal or unrelated clutter (e.g. snacks, decorative items) mixed in with cleaning supplies."
    ],
    "action_plan": [
      "Reorganize shelves so that cleaning supplies and office items are stored on separate levels; remove any mixed items from the same shelf.",
      "Remove all personal or unrelated clutter (e.g. office supplies, decorative items) from the cleaning supplies cabinet and relocate to appropriate storage."
    ],
    "visual_feedback": [
      "Second shelf in the first submission photo shows light bulbs and notebooks mixed with cleaning sponges on the same level.",
      "Third shelf in the first submission photo contains pens and scissors mixed with cleaning supplies."
    ],
    "notes": ""
  },
  {
    "store": "060",
    "failed_criteria": [
      "All cleaning supplies and related chemicals are stored inside the designated cabinet.",
      "No personal or unrelated clutter (e.g. snacks, decorative items) mixed in with cleaning supplies."
    ],
    "action_plan": [
      "Relocate all cleaning supplies from under the sink cabinet into the designated cleaning supplies cabinet.",
      "Remove unrelated items such as the first aid kit from the cleaning supply storage area."
    ],
    "visual_feedback": [
      "Cleaning chemicals visible under sink cabinet in second and third photos instead of designated cabinet.",
      "First aid kit stored under sink alongside cleaning chemicals in third photo."
    ],
    "notes": ""
  },
  {
    "store": "070",
    "failed_criteria": [
      "At least one image must clearly show the designated cleaning supplies cabinet, with shelves visibly stocked in a reasonably organized manner.",
      "All cleaning supplies and related chemicals are stored inside the designated cabinet."
    ],
    "action_plan": [
      "Capture at least one clear photo of the designated cleaning supplies cabinet with shelves stocked with visible cleaning supplies in an organized manner.",
      "Relocate all cleaning supplies and related chemicals inside the designated cabinet before photographing."
    ],
    "visual_feedback": [
      "Cabinet shelves contain mostly boxes and office items with no visible cleaning chemicals; actual cleaning supplies are on a cart under the sink and on top of the cabinet."
    ],
    "notes": ""
  },
  {
    "store": "075",
    "failed_criteria": [
      "Shelves may mix cleaning supplies with office items only if grouped by level: found cleaning supplies and non-cleaning items on the same shelf"
    ],
    "action_plan": [
      "Reorganize shelves so that each shelf level contains only cleaning supplies or only office/other items; move non-cleaning items onto a separate shelf"
    ],
    "visual_feedback": [
      "Second shelf from the top has electronics/tools mixed together with spray bottles and cleaning chemicals on the same shelf"
    ],
    "notes": ""
  },
  {
    "store": "077",
    "failed_criteria": [
      "Shelves may mix cleaning supplies with office items (pens, flashlights, stationery) only if they are grouped by level.",
      "No personal or unrelated clutter (e.g. snacks, decorative items) mixed in with cleaning supplies."
    ],
    "action_plan": [
      "Relocate non-cleaning/non-office items (first aid kit, toilet paper) to a separate shelf or remove them from the cabinet to ensure grouping by shelf.",
      "Remove all personal or unrelated items from the cabinet so only cleaning supplies and approved office items remain."
    ],
    "visual_feedback": [
      "Bottom shelf contains a first aid kit and toilet paper packs alongside cleaning chemicals, indicating mixed non-cleaning items."
    ],
    "notes": ""
  },
  {
    "store": "088",
    "failed_criteria": [
      "All cleaning supplies and related chemicals are stored inside the designated cabinet."
    ],
    "action_plan": [
      "Relocate all cleaning supplies from outside storage (e.g., racks, shelves) into the designated cabinet."
    ],
    "visual_feedback": [
      "Cleaning sprays, paper towels, and other cleaning items are stored on an open rack outside the designated cabinet in the third image."
    ],
    "notes": ""
  },
  {
    "store": "090",
    "failed_criteria": [
      "All cleaning supplies and related chemicals are stored inside the designated cabinet."
    ],
    "action_plan": [
      "Stock the designated cleaning supplies cabinet with all required cleaning supplies and related chemicals, ensuring they are stored inside the cabinet."
    ],
    "visual_feedback": [
      "Cabinet shelves contain office supplies (thermal paper rolls, boxes, electronics) but no visible cleaning chemicals."
    ],
    "notes": ""
  },
  {
    "store": "091",
    "failed_criteria": [
      "Shelves may mix cleaning supplies with office items only if they are grouped by level"
    ],
    "action_plan": [
      "Reorganize the cabinet so that each shelf contains either only cleaning supplies or only non-cleaning items. Ensure cleaning chemicals are grouped on separate shelves from office supplies."
    ],
    "visual_feedback": [
      "Middle shelf in the second submission photo shows cleaning supplies (spray bottles) mixed with office/non-cleaning items (packaging tape, electronic accessories) on the same level."
    ],
    "notes": ""
  },
  {
    "store": "099",
    "failed_criteria": [
      "At least one image must clearly show the designated cleaning supplies cabinet, with shelves visibly stocked in a reasonably organized manner."
    ],
    "action_plan": [
      "Retake photo for D5: Ensure the designated cabinet contains visible cleaning supplies on the shelves and is organized according to the policy."
    ],
    "visual_feedback": [
      "No cleaning chemicals or sprays visible; only office supplies (boxes, paper, folders) are on the shelves."
    ],
    "notes": ""
  },
  {
    "store": "101",
    "failed_criteria": [
      "Shelves may mix cleaning supplies with office items only if grouped by level: found mixing on same shelf"
    ],
    "action_plan": [
      "Separate cleaning supplies and office items by shelf: move all non-cleaning items on the mixed shelf to a dedicated office supply shelf."
    ],
    "visual_feedback": [
      "Shelf 4 contains both cleaning items (disinfectant wipes, cleaning jug) and office supply boxes, indicating mixing on the same level."
    ],
    "notes": ""
  },
  {
    "store": "105",
    "failed_criteria": [
      "Shelves mix cleaning supplies with non-cleaning items on the same shelf level",
      "Personal or unrelated clutter present in cabinet"
    ],
    "action_plan": [
      "Group non-cleaning items and cleaning supplies on separate shelves: move beverage and other personal items to a different cabinet or shelf level away from cleaning chemicals.",
      "Remove all personal or unrelated items (e.g. beverages, snacks) from the cleaning supplies cabinet."
    ],
    "visual_feedback": [
      "Beverage bottle visible on middle shelf alongside cleaning chemicals indicates mixing of personal and cleaning items.",
      "Presence of beverage on shelf shows personal clutter mixed with cleaning supplies."
    ],
    "notes": ""
  },
  {
    "store": "109",
    "failed_criteria": [
      "All cleaning supplies and related chemicals are stored inside the designated cabinet"
    ],
    "action_plan": [
      "Ensure all cleaning supplies and chemicals are stored inside the designated cabinet. Remove items such as dustpan and large cleaning jugs from the floor and place them on the cabinet shelves."
    ],
    "visual_feedback": [
      "Blue dustpan, brush, and cleaning jugs visible on the floor outside the designated cabinet (bottom of second image)"
    ],
    "notes": ""
  }
]