[
  {
    "store": "010",
    "failed_criteria": [
      "All cleaning supplies and related chemicals are stored inside the designated cabinet."
    ],
    "action_plan": [
      "Stock and display cleaning supplies and related chemicals inside the designated cabinet so they are visible in the photo."
    ],
    "visual_feedback": [
      "No cleaning supplies or chemicals detected; shelves contain only office supplies, thermal rolls, and storage boxes."
    ],
    "notes": ""
  },
  {
    "store": "033",
    "failed_criteria": [
      "Shelves mix cleaning chemicals and non-cleaning items without grouping",
      "Unrelated clutter (office supplies, electronics) mixed with cleaning supplies"
    ],
    "action_plan": [
      "Group cleaning supplies together on separate shelves or sections, ensuring no non-cleaning items are stored on those shelves",
      "Remove all office supplies and electronic items from the cleaning cabinet to maintain a tidy, designated cleaning supply storage area"
    ],
    "visual_feedback": [
      "Top-middle and right compartments show cords and keyboards mixed with cleaning items",
      "Cables and electronics dominate compartments, indicating unrelated clutter in the cabinet"
    ],
    "notes": ""
  },
  {
    "store": "038",
    "failed_criteria": [
      "Submission photo unreviewable for assessing standard compliance"
    ],
    "action_plan": [
      "Retake photo for D5: Cleaning Supplies & Cabinet Organization: Ensure image is clear, well-lit, correctly framed, and accurately shows the designated cleaning supplies cabinet with shelves stocked as per policy guidelines."
    ],
    "visual_feedback": [],
    "notes": "Incorrect photo submitted; expected cleaning supplies cabinet view, received cabinet with office supplies. ACTION: Escalate for human review due to low confidence."
  },
  {
    "store": "059",
    "failed_criteria": [
      "At least one image must clearly show the designated cleaning supplies cabinet, with shelves visibly stocked in a reasonably organized manner."
    ],
    "action_plan": [
      "Retake photo to clearly show the designated cleaning supplies cabinet with cleaning supplies organized on shelves."
    ],
    "visual_feedback": [
      "Submission photos show an under-sink area and a cabinet with office supplies, but no clear image of the designated cleaning supplies cabinet."
    ],
    "notes": ""
  },
  {
    "store": "068",
    "failed_criteria": [
      "At least one image must clearly show the designated cleaning supplies cabinet, with shelves visibly stocked in a reasonably organized manner.",
      "All cleaning supplies and related chemicals are stored inside the designated cabinet.",
      "Shelves may mix cleaning supplies with office items only if they are grouped by level: cleaning chemicals and non-cleaning items appear mixed together.",
      "No personal or unrelated clutter mixed in with cleaning supplies."
    ],
    "action_plan": [
      "Retake photo showing the actual designated cleaning supplies cabinet (with doors open) and stocked neatly on shelves.",
      "Ensure all cleaning supplies and chemicals are placed inside the designated cabinet before photographing.",
      "Organize shelves so that cleaning supplies are grouped on one level and office or non-cleaning items on a separate level.",
      "Remove personal or unrelated items (e.g., flowers, mugs, plates, snacks) from the cleaning supplies storage area."
    ],
    "visual_feedback": [
      "The photo shows an open wooden shelving unit in an office setting, not the designated cleaning supplies cabinet.",
      "Cleaning bottles and wipes are on open shelves rather than inside a cabinet.",
      "Office supplies (pens, mugs, plates) are interspersed with cleaning items on the shelves.",
      "Decorative items (flowers, mugs) are present alongside cleaning supplies."
    ],
    "notes": ""
  },
  {
    "store": "089",
    "failed_criteria": [
      "At least one image must clearly show the designated cleaning supplies cabinet, with shelves visibly stocked in a reasonably organized manner.",
      "All cleaning supplies and related chemicals are stored inside the designated cabinet."
    ],
    "action_plan": [
      "Retake photo ensuring the designated cleaning supplies cabinet is clearly shown with shelves visibly stocked in an organized manner, displaying cleaning supplies prominently.",
      "Ensure all cleaning supplies and chemicals are stored inside the designated cabinet before taking a new photo."
    ],
    "visual_feedback": [
      "Submission image shows mostly office supplies and stationery with minimal cleaning supplies, failing to depict the designated cleaning cabinet stocked with cleaning items.",
      "Only a single roll of paper towels is visible as a cleaning supply, with other items predominantly non-cleaning and not properly grouped."
    ],
    "notes": ""
  },
  {
    "store": "093",
    "failed_criteria": [
      "At least one image must clearly show the designated cleaning supplies cabinet, with shelves visibly stocked in a reasonably organized manner.",
      "All cleaning supplies and related chemicals are stored inside the designated cabinet."
    ],
    "action_plan": [
      "Place the designated cleaning supplies inside the cabinet and retake the photo showing shelves stocked with cleaning supplies in an organized manner.",
      "Ensure all cleaning supplies and related chemicals are stored inside the designated cabinet before submission."
    ],
    "visual_feedback": [
      "Cabinet shelves contain office items and electronics but no cleaning supplies across all visible shelves.",
      "No cleaning chemicals or supplies are present in the cabinet; appears used for storage of toner cartridges and office materials."
    ],
    "notes": ""
  },
  {
    "store": "096",
    "failed_criteria": [
      "At least one image must clearly show the designated cleaning supplies cabinet, with shelves visibly stocked in a reasonably organized manner.",
      "All cleaning supplies and related chemicals are stored inside the designated cabinet."
    ],
    "action_plan": [
      "Retake photos ensuring the designated cleaning supplies cabinet is fully open and clearly visible with shelves stocked and organized.",
      "Place all cleaning supplies and related chemicals inside the designated cabinet before retaking the photo."
    ],
    "visual_feedback": [
      "Submission photo shows cleaning supplies stored on an open rack instead of inside the designated cabinet.",
      "No image depicts the required cleaning supplies cabinet."
    ],
    "notes": ""
  },
  {
    "store": "098",
    "failed_criteria": [
      "All cleaning supplies and related chemicals are stored inside the designated cabinet."
    ],
    "action_plan": [
      "Store all cleaning supplies and related chemicals inside the designated cleaning cabinet so that the majority of items are housed within the cabinet."
    ],
    "visual_feedback": [
      "Multiple spray bottles and large jugs are currently placed on the wooden unit and wall shelf outside the designated cabinet, rather than inside."
    ],
    "notes": ""
  }
]