[
  {
    "store": "002",
    "failed_criteria": [
      "Microwave and fridge interiors should appear clean and hygienic. Some minor discoloration or stains from long-term use is acceptable as long as no food residue or debris is present.",
      "No food particles, spills, or leftover items visible inside appliances or on surfaces."
    ],
    "action_plan": [
      "Empty refrigerator interior of all food items and remove any visible debris before photographing.",
      "Clean and sanitize both microwave and refrigerator interiors to remove any food particles or spills, then re-photograph."
    ],
    "visual_feedback": [
      "Refrigerator shelf (bottom center) shows a sauce container, a beverage bottle, and scattered food debris.",
      "Refrigerator ice tray area has visible food residue on the right side."
    ],
    "notes": ""
  },
  {
    "store": "006",
    "failed_criteria": [
      "No food particles, spills, or leftover items visible inside appliances or on surfaces."
    ],
    "action_plan": [
      "Remove all food items, including cans, from appliances before taking photo; ensure no food residue or debris remains inside before retaking the photo."
    ],
    "visual_feedback": [
      "A can of Coca-Cola is visible inside the fridge interior."
    ],
    "notes": ""
  },
  {
    "store": "013",
    "failed_criteria": [
      "No food particles, spills, or leftover items visible inside appliances or on surfaces."
    ],
    "action_plan": [
      "Remove all food items from the fridge and microwave before submitting the photo. Ensure interiors are empty of any leftover food or packaging."
    ],
    "visual_feedback": [
      "Packaged bread and snack items visible on the bottom shelf of the fridge."
    ],
    "notes": ""
  },
  {
    "store": "014",
    "failed_criteria": [
      "No food particles, spills, or leftover items visible inside appliances or on surfaces."
    ],
    "action_plan": [
      "Remove all food items or jars from inside the fridge; ensure appliance interiors are empty and clean before retaking photo."
    ],
    "visual_feedback": [
      "Glass jar visible on bottom shelf of fridge interior",
      "Jar of peanut butter visible on fridge door shelf"
    ],
    "notes": ""
  },
  {
    "store": "015",
    "failed_criteria": [
      "Food particles or debris visible inside microwave",
      "Food particles or debris visible inside refrigerator"
    ],
    "action_plan": [
      "Thoroughly clean the microwave interior to remove all food residue and debris; wipe down surfaces and retake photo when clean.",
      "Thoroughly clean the refrigerator interior to remove all food residue and debris; wipe down surfaces and retake photo when clean."
    ],
    "visual_feedback": [
      "Brown specks visible on the top interior and turntable of the microwave.",
      "Small debris spot visible on the right interior wall of the refrigerator."
    ],
    "notes": ""
  },
  {
    "store": "019",
    "failed_criteria": [
      "No food particles, spills, or leftover items visible inside appliances or on surfaces."
    ],
    "action_plan": [
      "Remove all bottles, wrappers, and any other items from the fridge interior, clean the surfaces, and resubmit a clear photo showing an empty and hygienic appliance."
    ],
    "visual_feedback": [
      "A water bottle and a snack wrapper are visible on the middle shelf of the fridge."
    ],
    "notes": ""
  },
  {
    "store": "020",
    "failed_criteria": [
      "No food particles, spills, or leftover items visible inside appliances or on surfaces"
    ],
    "action_plan": [
      "Remove all leftover items from the fridge interior before retaking the photo."
    ],
    "visual_feedback": [
      "Fridge interior (bottom-right image) contains two water bottles on the shelf."
    ],
    "notes": ""
  },
  {
    "store": "022",
    "failed_criteria": [
      "No food particles, spills, or leftover items visible inside appliances or on surfaces."
    ],
    "action_plan": [
      "Thoroughly clean the microwave interior to remove all food residue or debris."
    ],
    "visual_feedback": [
      "Small food debris and crumbs are visible on the microwave interior floor (see microwave photo with timestamp 2025/06/07 05:38:42)."
    ],
    "notes": ""
  },
  {
    "store": "024",
    "failed_criteria": [
      "No food particles, spills, or leftover items visible inside appliances or on surfaces."
    ],
    "action_plan": [
      "Remove any debris or residue from the shelf surface; clean and sanitize all break room surfaces thoroughly."
    ],
    "visual_feedback": [
      "Debris visible on the shelf surface beneath the microwave."
    ],
    "notes": ""
  },
  {
    "store": "030",
    "failed_criteria": [
      "No food particles, spills, or leftover items visible inside appliances or on surfaces."
    ],
    "action_plan": [
      "Remove all leftover items (e.g., water bottles) from the refrigerator interior before submitting the photo."
    ],
    "visual_feedback": [
      "Water bottles visible in the refrigerator door compartments in the submission photo with timestamp 2025/06/11 10:13:34."
    ],
    "notes": ""
  },
  {
    "store": "033",
    "failed_criteria": [
      "No food particles, spills, or leftover items visible inside appliances or on surfaces."
    ],
    "action_plan": [
      "Remove all food containers and debris from inside the microwave and fridge, and thoroughly clean all interior surfaces to eliminate food residue before resubmitting the photo."
    ],
    "visual_feedback": [
      "Brown food residue visible along the top interior surface of the microwave.",
      "Jar of food and food particles visible on the fridge door shelf."
    ],
    "notes": ""
  },
  {
    "store": "041",
    "failed_criteria": [
      "Microwave interior shows visible residue/debris",
      "Food items visible inside fridge interior"
    ],
    "action_plan": [
      "Clean microwave interior thoroughly to remove all food residue and debris",
      "Remove all food items and personal supplies from fridge when photographing; ensure interior is empty and clean"
    ],
    "visual_feedback": [
      "Brown spots and debris visible on the bottom and top interior surfaces of the microwave",
      "Fruits visible on the bottom shelf of the fridge and water bottles in the door compartments"
    ],
    "notes": ""
  },
  {
    "store": "047",
    "failed_criteria": [
      "No food particles, spills, or leftover items visible inside appliances or on surfaces."
    ],
    "action_plan": [
      "Remove all food items or leftover items from inside the fridge before taking the photo."
    ],
    "visual_feedback": [
      "Leftover food on a plate visible on the fridge shelf."
    ],
    "notes": ""
  },
  {
    "store": "049",
    "failed_criteria": [
      "No food particles, spills, or leftover items visible inside appliances or on surfaces."
    ],
    "action_plan": [
      "Clean microwave interior thoroughly to remove all food residue, spills, and debris; then resubmit photo showing a clean interior free of any visible particles."
    ],
    "visual_feedback": [
      "Visible brown residue and debris along left interior wall and base of microwave turntable."
    ],
    "notes": ""
  },
  {
    "store": "052",
    "failed_criteria": [
      "Microwave and fridge interiors should appear clean and hygienic. Some minor discoloration or stains from long-term use is acceptable as long as no food residue or debris is present.",
      "No food particles, spills, or leftover items visible inside appliances or on surfaces."
    ],
    "action_plan": [
      "Thoroughly clean the microwave and fridge interiors to remove any food residue, debris, and ice buildup; ensure surfaces are free of stains and hygienic.",
      "Remove all food particles, spills, and leftover items (e.g., water bottles) from inside appliances, and wipe surfaces clean before retaking the photo."
    ],
    "visual_feedback": [
      "Visible food debris on the back interior wall of the microwave and excessive frost buildup on the back wall of the fridge interior.",
      "Small food particle present on microwave floor and two water bottles visible on fridge shelf."
    ],
    "notes": ""
  },
  {
    "store": "057",
    "failed_criteria": [
      "No food particles, spills, or leftover items visible inside appliances or on surfaces."
    ],
    "action_plan": [
      "Remove all food items and personal storage from the fridge interior and retake the photo."
    ],
    "visual_feedback": [
      "Leftover box of pastries and a small cup visible on the fridge shelves."
    ],
    "notes": ""
  },
  {
    "store": "058",
    "failed_criteria": [
      "No food particles, spills, or leftover items visible inside appliances or on surfaces."
    ],
    "action_plan": [
      "Remove all food packets or containers (e.g., condiment packets) from inside fridge before submission photo to ensure no leftover items are present."
    ],
    "visual_feedback": [
      "Ketchup condiment packets visible at top left interior of fridge."
    ],
    "notes": ""
  },
  {
    "store": "060",
    "failed_criteria": [
      "Microwave interior shows food residue or debris",
      "Leftover items visible inside fridge interior"
    ],
    "action_plan": [
      "Clean the microwave interior thoroughly to remove any food residue or debris and retake the photo showing a spotless interior.",
      "Remove all personal food items and containers from the fridge interior, wipe down surfaces, and retake the photo showing only a clean, empty interior (or only acceptable items like factory-sealed bottles)."
    ],
    "visual_feedback": [
      "Small brown food residue spots visible on the bottom interior surface of the microwave (see image with timestamp 2025/05/28 12:16:42).",
      "Uncovered food container visible on bottom shelf of fridge interior along with a water bottle (see image with timestamp 2025/05/28 12:17:01)."
    ],
    "notes": ""
  },
  {
    "store": "064",
    "failed_criteria": [
      "No food particles, spills, or leftover items visible inside appliances or on surfaces."
    ],
    "action_plan": [
      "Remove all food items, beverages, and leftover containers from the fridge interior before photographing to ensure no items are visible."
    ],
    "visual_feedback": [
      "Tupperware container on middle refrigerator shelf and bottles with beverages visible in fridge compartments."
    ],
    "notes": ""
  },
  {
    "store": "066",
    "failed_criteria": [
      "Microwave and fridge interiors should appear clean and hygienic. Some minor discoloration or stains from long-term use is acceptable as long as no food residue or debris is present.",
      "No food particles, spills, or leftover items visible inside appliances or on surfaces."
    ],
    "action_plan": [
      "Thoroughly clean the microwave interior to remove all food residue, stains, and debris. Wipe down walls, ceiling, and glass tray until hygienic.",
      "Remove all non-essential items (e.g., bottles) from the fridge interior and wipe down surfaces to eliminate any spills or residue."
    ],
    "visual_feedback": [
      "Visible food debris and dark stains on the microwave floor and side walls.",
      "Three bottles stored in the fridge compartment—remove all items to meet cleanliness standard."
    ],
    "notes": ""
  },
  {
    "store": "068",
    "failed_criteria": [
      "Microwave and fridge interiors should appear clean and hygienic. Some minor discoloration or stains from long-term use is acceptable as long as no food residue or debris is present.",
      "No food particles, spills, or leftover items visible inside appliances or on surfaces."
    ],
    "action_plan": [
      "Remove all food debris and thoroughly clean the microwave and fridge interiors to ensure hygienic appearance.",
      "Wipe down all surfaces and remove any food particles, spills, or leftover items from appliances and shelves."
    ],
    "visual_feedback": [
      "Food debris visible on fridge interior shelf in the bottom compartment near the rear wall.",
      "Small leftover item visible on fridge shelf violating the no food particles requirement."
    ],
    "notes": ""
  },
  {
    "store": "070",
    "failed_criteria": [
      "Microwave and fridge interiors should appear clean and hygienic. Some minor discoloration or stains from long-term use is acceptable as long as no food residue or debris is present.",
      "No food particles, spills, or leftover items visible inside appliances or on surfaces."
    ],
    "action_plan": [
      "Thoroughly clean the microwave interior to remove all visible food residue and debris, ensuring a hygienic appearance before retaking the photo.",
      "Empty the fridge of any items (e.g., water bottle) and remove any food particles or spills, then retake the photo showing only a clean interior."
    ],
    "visual_feedback": [
      "Visible brown residue and small debris on the microwave turntable and along the top right interior corner.",
      "A water bottle is present on a fridge shelf, indicating leftover items inside the appliance."
    ],
    "notes": ""
  },
  {
    "store": "074",
    "failed_criteria": [
      "No food particles, spills, or leftover items visible inside appliances or on surfaces."
    ],
    "action_plan": [
      "Remove all items (e.g., bottles, containers) from inside appliances before photographing to ensure interiors are empty."
    ],
    "visual_feedback": [
      "Fridge image shows a water bottle and containers inside the door compartment."
    ],
    "notes": ""
  },
  {
    "store": "075",
    "failed_criteria": [
      "No food particles, spills, or leftover items visible inside appliances or on surfaces."
    ],
    "action_plan": [
      "Remove all personal items, beverages, and leftover food from inside the refrigerator before taking the photo; ensure the interior is empty and hygienic."
    ],
    "visual_feedback": [
      "Soda bottles and water bottles visible on the refrigerator shelf in multiple submission images."
    ],
    "notes": ""
  },
  {
    "store": "087",
    "failed_criteria": [
      "Microwave and fridge interiors should appear clean and hygienic. Some minor discoloration or stains from long-term use is acceptable as long as no food residue or debris is present.",
      "No food particles, spills, or leftover items visible inside appliances or on surfaces."
    ],
    "action_plan": [
      "Thoroughly clean the microwave interior to remove all food residue and debris, then retake the photo ensuring the interior is free of any spills or particles.",
      "Ensure no food particles, spills, or leftover items are visible inside appliances before capturing the photo."
    ],
    "visual_feedback": [
      "Brown food stains and debris visible on the back wall of the microwave.",
      "Food residue present on the microwave turntable."
    ],
    "notes": ""
  },
  {
    "store": "090",
    "failed_criteria": [
      "No food particles, spills, or leftover items visible inside appliances or on surfaces."
    ],
    "action_plan": [
      "Remove all leftover items (towel, food containers, bottles) from microwave and fridge before taking the photo.",
      "Retake image ensuring both microwave and fridge interiors are empty and free of personal items."
    ],
    "visual_feedback": [
      "Towel/pad visible on microwave turntable indicating a leftover item.",
      "Water bottle and container visible on fridge shelves indicating personal items left inside."
    ],
    "notes": ""
  },
  {
    "store": "093",
    "failed_criteria": [
      "No food particles, spills, or leftover items visible inside appliances or on surfaces."
    ],
    "action_plan": [
      "Clean the microwave interior thoroughly to remove visible food particles or debris; retake the photo ensuring no residue remains."
    ],
    "visual_feedback": [
      "Small food particles or debris visible on the microwave turntable."
    ],
    "notes": ""
  },
  {
    "store": "096",
    "failed_criteria": [
      "Microwave and fridge interiors should appear clean and hygienic. Some minor discoloration or stains from long-term use is acceptable as long as no food residue or debris is present.",
      "No food particles, spills, or leftover items visible inside appliances or on surfaces."
    ],
    "action_plan": [
      "Thoroughly clean the microwave and fridge interiors, removing all food residue and debris to ensure hygienic appearance.",
      "Remove all food particles, spills, and any leftover items from the appliances surfaces and interiors before retaking the photo."
    ],
    "visual_feedback": [
      "Visible food residue and stains on microwave interior walls and turntable edge.",
      "Two water bottles and water droplets visible on fridge shelves indicating leftover items and spills."
    ],
    "notes": ""
  },
  {
    "store": "098",
    "failed_criteria": [
      "No food particles, spills, or leftover items visible inside appliances or on surfaces."
    ],
    "action_plan": [
      "Remove all food or beverage items from appliance interiors before taking the photo and resubmit."
    ],
    "visual_feedback": [
      "Green bottle present on the bottom shelf of the fridge door in the submission photo."
    ],
    "notes": ""
  },
  {
    "store": "100",
    "failed_criteria": [
      "No food particles, spills, or leftover items visible inside appliances or on surfaces."
    ],
    "action_plan": [
      "Thoroughly clean the microwave interior to remove all food residue and spills. Retake the submission photo ensuring the appliance is free of debris."
    ],
    "visual_feedback": [
      "Food residue and brown spots visible on the right interior wall and on the turntable rim of the microwave."
    ],
    "notes": ""
  },
  {
    "store": "101",
    "failed_criteria": [
      "No food particles, spills, or leftover items visible inside appliances or on surfaces."
    ],
    "action_plan": [
      "Remove all food particles, spills, and leftover items from inside the fridge and ensure it is empty and clean before retaking the photo."
    ],
    "visual_feedback": [
      "A plastic container with visible leftover food is on the middle shelf of the fridge interior."
    ],
    "notes": ""
  },
  {
    "store": "102",
    "failed_criteria": [
      "No food particles, spills, or leftover items visible inside appliances or on surfaces."
    ],
    "action_plan": [
      "Remove all items (e.g., water bottles) from the fridge interior before taking the photo. Ensure there are no food particles, spills, or leftover items visible, then retake and resubmit the image."
    ],
    "visual_feedback": [
      "Water bottles visible on the right door shelf of the fridge interior."
    ],
    "notes": ""
  },
  {
    "store": "106",
    "failed_criteria": [
      "No food particles, spills, or leftover items visible inside appliances or on surfaces"
    ],
    "action_plan": [
      "Remove all personal or leftover food items from fridge before taking photo. Ensure no food particles, spills, or leftover items are visible."
    ],
    "visual_feedback": [
      "Bag of food items visible on fridge shelf."
    ],
    "notes": ""
  },
  {
    "store": "108",
    "failed_criteria": [
      "No food particles, spills, or leftover items visible inside appliances or on surfaces."
    ],
    "action_plan": [
      "Remove any debris or leftover items from the fridge interior and retake the photo showing a completely clean surface."
    ],
    "visual_feedback": [
      "Blue piece of debris visible on the lower shelf of the fridge interior."
    ],
    "notes": ""
  },
  {
    "store": "110",
    "failed_criteria": [
      "No food particles, spills, or leftover items visible inside appliances or on surfaces."
    ],
    "action_plan": [
      "Remove all food items and containers from the refrigerator before photographing to ensure no leftover items are visible."
    ],
    "visual_feedback": [
      "Leftover food items (apple, plastic container, bottle) visible inside refrigerator interior in submission photo."
    ],
    "notes": ""
  }
]