[
  {
    "store": "002",
    "failed_criteria": [
      "DVR vents and heat sinks obstructed or lack required clearance",
      "Area has excessive dust or debris"
    ],
    "action_plan": [
      "Reposition equipment to ensure at least a few inches of clearance around all exposed DVR vents and heat sinks",
      "Clean the area around the DVR, removing debris and excessive dust to prevent interference with operation"
    ],
    "visual_feedback": [
      "Monitor is placed directly adjacent to the DVR's left side, blocking required vent clearance",
      "Desk surface shows significant white debris and dust around the DVR"
    ],
    "notes": ""
  },
  {
    "store": "005",
    "failed_criteria": [
      "DVR vents and heat sinks must be unobstructed—allow at least a few inches of clearance around all exposed sides (top and side panels); bottom surface contact with the resting surface is acceptable."
    ],
    "action_plan": [
      "Relocate the monitor from on top of the DVR to ensure vents and heat sinks are unobstructed, maintaining at least a few inches of clearance around all exposed sides."
    ],
    "visual_feedback": [
      "Monitor placed on DVR top blocking top vents and preventing proper heat dissipation."
    ],
    "notes": ""
  },
  {
    "store": "010",
    "failed_criteria": [
      "DVR vents and heat sinks obstructed by stacking monitor—insufficient clearance around exposed sides"
    ],
    "action_plan": [
      "Ensure at least a few inches of clearance around all exposed sides of the DVR by relocating the monitor off the DVR top or using a riser to maintain proper airflow"
    ],
    "visual_feedback": [
      "Monitor is stacked directly on top of the DVR, blocking the top vents and preventing required clearance for heat dissipation"
    ],
    "notes": ""
  },
  {
    "store": "013",
    "failed_criteria": [
      "DVR vents and heat sinks must be unobstructed—allow at least a few inches of clearance around all exposed sides (top and side panels)"
    ],
    "action_plan": [
      "Remove the monitor from on top of the DVR and maintain at least a few inches of clearance around all exposed sides (top and side) to ensure proper ventilation"
    ],
    "visual_feedback": [
      "Monitor base sitting directly on top of DVR front half, blocking top vents"
    ],
    "notes": ""
  },
  {
    "store": "014",
    "failed_criteria": [
      "DVR vents and heat sinks obstructed: insufficient clearance around exposed side panels"
    ],
    "action_plan": [
      "Reposition DVR to allow at least a few inches of clearance on all exposed sides, ensuring vents are unobstructed"
    ],
    "visual_feedback": [
      "DVR is placed flush against the side panel of the shelf, blocking side vent clearance"
    ],
    "notes": ""
  },
  {
    "store": "015",
    "failed_criteria": [
      "DVR vents and heat sinks must be unobstructed—allow at least a few inches of clearance around all exposed sides"
    ],
    "action_plan": [
      "Relocate the monitor off the DVR (or provide a separate stand) to ensure at least a few inches of clearance on the top and side panels for proper heat dissipation."
    ],
    "visual_feedback": [
      "Monitor base is directly placed on top of the DVR, covering the top panel and obstructing vents."
    ],
    "notes": ""
  },
  {
    "store": "020",
    "failed_criteria": [
      "DVR vents and heat sinks must be unobstructed—allow at least a few inches of clearance around all exposed sides (top and side panels)"
    ],
    "action_plan": [
      "Reposition DVR to ensure at least a few inches of clearance on all exposed sides, particularly between the DVR and adjacent equipment, to prevent ventilation obstruction."
    ],
    "visual_feedback": [
      "Left side of DVR is touching the adjacent PC tower, obstructing side vent clearance. Ensure at least 2–3 inches gap."
    ],
    "notes": ""
  },
  {
    "store": "024",
    "failed_criteria": [
      "DVR vents and heat sinks obstructed by adjacent items (insufficient clearance)"
    ],
    "action_plan": [
      "Reposition DVR to provide at least a few inches of clearance around all exposed sides, especially behind where boxes are currently touching."
    ],
    "visual_feedback": [
      "Boxes directly adjacent to the right side panel blocking vent clearance."
    ],
    "notes": ""
  },
  {
    "store": "039",
    "failed_criteria": [
      "DVR vents and heat sinks obstructed by monitor placement",
      "Excessive dust accumulation on DVR unit"
    ],
    "action_plan": [
      "Ensure at least a few inches of clearance around all exposed DVR vents; reposition monitor to provide proper airflow",
      "Clean the DVR and surrounding area to remove dust accumulation, ensuring vents and surfaces are clear"
    ],
    "visual_feedback": [
      "Monitor base covers vent area on top of DVR",
      "Dust visible on top panel of DVR"
    ],
    "notes": ""
  },
  {
    "store": "043",
    "failed_criteria": [
      "DVR vents and heat sinks must be unobstructed—allow at least a few inches of clearance around all exposed sides (top and side panels)"
    ],
    "action_plan": [
      "Ensure at least 2–3 inches of clearance around all DVR vents by relocating cables off the top panel and moving the unit away from adjacent surfaces to improve heat dissipation."
    ],
    "visual_feedback": [
      "Cables resting on top panel near vent areas potentially blocking airflow.",
      "Right side of DVR is placed directly against the wall, restricting clearance for side vents."
    ],
    "notes": ""
  },
  {
    "store": "045",
    "failed_criteria": [
      "DVR vents and heat sinks obstructed—insufficient clearance on exposed side panels"
    ],
    "action_plan": [
      "Reposition DVR to ensure at least a few inches of clearance on all exposed sides; move surrounding boxes away from DVR vents and heat sinks"
    ],
    "visual_feedback": [
      "Boxes are placed directly against the left and right sides of the DVR, blocking airflow around the side vents"
    ],
    "notes": ""
  },
  {
    "store": "046",
    "failed_criteria": [
      "DVR vents and heat sinks must be unobstructed—allow at least a few inches of clearance around all exposed sides (top and side panels); bottom surface contact with the resting surface is acceptable."
    ],
    "action_plan": [
      "Reposition monitor and DVR setup to ensure at least a few inches of clearance on all exposed sides—particularly remove monitor from direct contact with the DVR top and provide side clearance for proper ventilation."
    ],
    "visual_feedback": [
      "Monitor resting directly on top of DVR is blocking the top vents, as seen by the monitor’s base contacting the DVR surface.",
      "DVR is positioned flush against the right wall, providing no side clearance for heat dissipation."
    ],
    "notes": ""
  },
  {
    "store": "047",
    "failed_criteria": [
      "DVR vents and heat sinks obstructed — no clearance around exposed sides"
    ],
    "action_plan": [
      "Reposition DVR to allow at least a few inches of clearance around all exposed sides for proper heat dissipation"
    ],
    "visual_feedback": [
      "Side vent fins of the DVR are flush against the wall, blocking airflow"
    ],
    "notes": ""
  },
  {
    "store": "049",
    "failed_criteria": [
      "DVR vents and heat sinks must be unobstructed—allow at least a few inches of clearance around all exposed sides (top and side panels)"
    ],
    "action_plan": [
      "Reposition DVR to ensure at least a few inches of clearance on all exposed sides (move unit away from walls and adjacent equipment) for proper ventilation"
    ],
    "visual_feedback": [
      "DVR is placed flush into the corner against two walls with no visible gap around side panels, risking vent obstruction"
    ],
    "notes": ""
  },
  {
    "store": "050",
    "failed_criteria": [
      "DVR vents and heat sinks must be unobstructed—allow at least a few inches of clearance around all exposed sides (top and side panels); bottom surface contact with the resting surface is acceptable."
    ],
    "action_plan": [
      "Reposition DVR to ensure at least a few inches of clearance around all exposed sides, especially the left side, to keep vents unobstructed."
    ],
    "visual_feedback": [
      "Left side of DVR is positioned directly next to the UPS device with no clearance, blocking side ventilation."
    ],
    "notes": ""
  },
  {
    "store": "052",
    "failed_criteria": [
      "DVR vents and heat sinks must be unobstructed—allow at least a few inches of clearance around all exposed sides (top and side panels); bottom surface contact with the resting surface is acceptable."
    ],
    "action_plan": [
      "Relocate DVR to provide at least a few inches of clearance on all exposed sides (top and side panels) for adequate ventilation."
    ],
    "visual_feedback": [
      "Right side of DVR is flush against the wall with no visible clearance for heat dissipation."
    ],
    "notes": ""
  },
  {
    "store": "056",
    "failed_criteria": [
      "Area should be free of excessive dust piles or debris that could interfere with equipment."
    ],
    "action_plan": [
      "Remove excess dust and debris from the DVR and surrounding surfaces to maintain proper equipment cleanliness."
    ],
    "visual_feedback": [
      "Visible dust accumulation on the top surface of the DVR and surrounding shelf in the timestamped photo."
    ],
    "notes": ""
  },
  {
    "store": "061",
    "failed_criteria": [
      "Insufficient clearance around DVR vents for proper heat dissipation on right side"
    ],
    "action_plan": [
      "Move the binder at the right side to ensure at least a few inches (≈5cm) of clearance around the DVR vents."
    ],
    "visual_feedback": [
      "Binder is positioned immediately adjacent to the right side of the DVR, restricting airflow."
    ],
    "notes": ""
  },
  {
    "store": "062",
    "failed_criteria": [
      "No non-essential items (e.g. personal clutter, loose papers, cleaning supplies) placed on or immediately covering the DVR."
    ],
    "action_plan": [
      "Remove all non-essential items from on or covering the DVR (e.g., papers) and ensure vents remain unobstructed before retaking the photo."
    ],
    "visual_feedback": [
      "A sheet of paper is placed on top of the DVR, covering its surface and potentially blocking ventilation."
    ],
    "notes": ""
  },
  {
    "store": "063",
    "failed_criteria": [
      "DVR vents and heat sinks must be unobstructed—insufficient clearance around exposed sides"
    ],
    "action_plan": [
      "Move boxes at least a few inches away from the DVR's side panels to ensure unobstructed vents for heat dissipation."
    ],
    "visual_feedback": [
      "Boxes are touching or too close to the DVR's left and right side panels, blocking vent clearance."
    ],
    "notes": ""
  },
  {
    "store": "064",
    "failed_criteria": [
      "Submission photo unreviewable for assessing standard compliance"
    ],
    "action_plan": [
      "Retake photo for D8: Security Office / DVR Area: Ensure image is clear, well-lit, correctly framed, and accurately shows the required area/details as per policy guidelines."
    ],
    "visual_feedback": [],
    "notes": "Incorrect photo submitted for D8: Security Office / DVR Area; expected view of DVR and surrounding area, received network rack equipment. ACTION: Escalate for human review due to low confidence."
  },
  {
    "store": "070",
    "failed_criteria": [
      "No non-essential items (e.g. personal clutter, loose papers, cleaning supplies) placed on or immediately covering the DVR."
    ],
    "action_plan": [
      "Remove all non-essential items from the DVR surface to ensure unobstructed vents and heat dissipation."
    ],
    "visual_feedback": [
      "Mouse placed on top of DVR covering the surface; remove it to comply with standards."
    ],
    "notes": ""
  },
  {
    "store": "074",
    "failed_criteria": [
      "DVR vents and heat sinks must be unobstructed—allow at least a few inches of clearance around all exposed sides (top and side panels)"
    ],
    "action_plan": [
      "Reposition DVR to allow at least a few inches of clearance on all exposed sides for proper heat dissipation."
    ],
    "visual_feedback": [
      "The DVR is placed flush against the left wall and adjacent to a box on the right, leaving insufficient side clearance for vents."
    ],
    "notes": ""
  },
  {
    "store": "075",
    "failed_criteria": [
      "Non-essential item covering DVR",
      "Obstructed DVR vents or insufficient clearance",
      "Excessive dust accumulation on DVR"
    ],
    "action_plan": [
      "Remove any non-essential items from on or immediately above the DVR, including the cardboard box to keep top panel and vents clear.",
      "Relocate DVR to ensure at least a few inches of clearance around all exposed sides for proper heat dissipation.",
      "Thoroughly clean the DVR and surrounding area to remove dust buildup and prevent interference with operation."
    ],
    "visual_feedback": [
      "Cardboard box resting on top panel of DVR (visible in second and third submission photos).",
      "DVR is placed flush against chair edges with no side clearance (second photo).",
      "Dust accumulation visible on DVR top surface (third photo)."
    ],
    "notes": ""
  },
  {
    "store": "077",
    "failed_criteria": [
      "DVR vents and heat sinks must be unobstructed—allow at least a few inches of clearance around all exposed sides (top and side panels)",
      "Area should be free of excessive dust piles or debris that could interfere with equipment"
    ],
    "action_plan": [
      "Relocate the DVR to provide at least a few inches of clearance around all exposed vents and heat sinks",
      "Thoroughly clean the area around the DVR to remove dust piles and debris"
    ],
    "visual_feedback": [
      "Side vents are touching the chair’s fabric without proper clearance",
      "Significant dust and peeling debris on the chair surface beneath and around the DVR"
    ],
    "notes": ""
  },
  {
    "store": "088",
    "failed_criteria": [
      "Submission photo unreviewable for assessing standard compliance"
    ],
    "action_plan": [
      "Retake photo for D8: Security Office / DVR Area: Ensure image is clear, well-lit, correctly framed, and accurately shows the required DVR equipment and surrounding area as per policy guidelines."
    ],
    "visual_feedback": [],
    "notes": "Incorrect photo submitted for D8: Security Office / DVR Area; expected view of DVR, received view of wall-mounted network/patch panel. ACTION: Escalate for human review due to low confidence."
  },
  {
    "store": "089",
    "failed_criteria": [
      "No non-essential items placed on or immediately covering the DVR",
      "DVR vents and heat sinks must be unobstructed"
    ],
    "action_plan": [
      "Remove the non-essential UPS unit from on top of the DVR.",
      "Ensure at least a few inches of clearance around all exposed sides of the DVR to keep vents and heat sinks unobstructed."
    ],
    "visual_feedback": [
      "A UPS unit is stacked directly on top of the DVR, covering its top vents and blocking airflow."
    ],
    "notes": ""
  },
  {
    "store": "090",
    "failed_criteria": [
      "No non-essential items placed on or immediately covering the DVR.",
      "DVR vents and heat sinks must be unobstructed—allow at least a few inches of clearance around all exposed sides (top and side panels); bottom surface contact with the resting surface is acceptable."
    ],
    "action_plan": [
      "Remove all non-essential items (e.g., remote, box, mouse) from on and around the DVR to ensure no clutter is placed on the equipment.",
      "Ensure DVR vents and heat sinks have at least a few inches of clearance on all exposed sides by removing objects obstructing the top and side panels."
    ],
    "visual_feedback": [
      "Remote control and cardboard box placed on top of DVR covering top vents.",
      "Top vents obstructed by objects, restricting airflow."
    ],
    "notes": ""
  },
  {
    "store": "091",
    "failed_criteria": [
      "No non-essential items placed on or immediately covering the DVR",
      "DVR vents and heat sinks must be unobstructed"
    ],
    "action_plan": [
      "Remove all non-essential items (e.g., computer mouse) from on top of the DVR",
      "Ensure at least a few inches of clearance around all exposed sides of the DVR for proper heat dissipation; reposition or remount if necessary"
    ],
    "visual_feedback": [
      {
        "problem": "Non-essential item (mouse) placed on top of DVR",
        "location": "Top surface of DVR"
      },
      {
        "problem": "No clearance between DVR back panel and wall, potentially blocking vents",
        "location": "Back side of DVR against wall"
      }
    ],
    "notes": ""
  },
  {
    "store": "093",
    "failed_criteria": [
      "DVR vents and heat sinks obstructed—insufficient clearance on top of the unit"
    ],
    "action_plan": [
      "Ensure at least a few inches of clearance above all exposed sides of the DVR by repositioning the shelf or relocating the DVR"
    ],
    "visual_feedback": [
      "Top of DVR is flush with overhead shelf, obstructing vent clearance"
    ],
    "notes": ""
  },
  {
    "store": "096",
    "failed_criteria": [
      "DVR vents and heat sinks must be unobstructed—insufficient clearance around exposed sides"
    ],
    "action_plan": [
      "Reposition the DVR to ensure at least a few inches of clearance on all exposed sides (top and side panels) for proper heat dissipation"
    ],
    "visual_feedback": [
      "DVR side panels are flush against the wooden mounting board with no side clearance"
    ],
    "notes": ""
  },
  {
    "store": "097",
    "failed_criteria": [
      "DVR vents and heat sinks must be unobstructed—allow at least a few inches of clearance around all exposed sides (top and side panels)"
    ],
    "action_plan": [
      "Reposition DVR to ensure at least a few inches of clearance on the top and sides from any shelving or walls so that vents and heat sinks are unobstructed."
    ],
    "visual_feedback": [
      "Metal mounting bracket is directly contacting the top panel, blocking ventilation vents.",
      "Right side of DVR is flush against the wall with no side clearance."
    ],
    "notes": ""
  },
  {
    "store": "099",
    "failed_criteria": [
      "DVR vents and heat sinks obstructed (insufficient clearance around exposed sides)"
    ],
    "action_plan": [
      "Ensure at least a few inches of clearance around all exposed DVR vents and heat sinks by pulling the DVR forward from the wall."
    ],
    "visual_feedback": [
      "DVR positioned flush against back wall with less than required clearance behind vents."
    ],
    "notes": ""
  },
  {
    "store": "101",
    "failed_criteria": [
      "Submission photo unreviewable for assessing standard compliance"
    ],
    "action_plan": [
      "Retake photo for D8: Security Office / DVR Area: Ensure image is clear, well-lit, correctly framed, and accurately shows the DVR setup area with no obstructions as per policy guidelines."
    ],
    "visual_feedback": [],
    "notes": "Incorrect photo submitted for D8: Security Office / DVR Area; DVR not visible or obscured by boxes. ACTION: Escalate for human review due to low confidence."
  },
  {
    "store": "105",
    "failed_criteria": [
      "Insufficient clearance for ventilation",
      "Excessive dust accumulation on DVR surface"
    ],
    "action_plan": [
      "Provide at least a few inches of clearance around the top and sides of the DVR for proper heat dissipation",
      "Clean dust from the DVR and surrounding area to maintain equipment cleanliness and prevent interference with operation"
    ],
    "visual_feedback": [
      "Top panel of DVR is flush against the wall with no visible clearance for ventilation",
      "Heavy dust buildup visible across the top surface of the DVR"
    ],
    "notes": ""
  },
  {
    "store": "106",
    "failed_criteria": [
      "Non-essential items placed on or covering the DVR",
      "DVR vents and heat sinks obstructed due to insufficient clearance",
      "Excessive dust or debris present near DVR vents"
    ],
    "action_plan": [
      "Remove all non-essential items (e.g., plastic-wrapped packaging) from on top of the DVR",
      "Ensure at least a few inches of clearance around all exposed sides of the DVR vents for proper heat dissipation",
      "Clean dust, cobwebs, and debris from DVR vents and surrounding area to prevent interference with equipment"
    ],
    "visual_feedback": [
      "Plastic-wrapped item visible resting on top of the DVR obstructing the surface",
      "DVR mounted flush against the wall blocking side vent openings",
      "Cobwebs and dust buildup around the side vent area"
    ],
    "notes": ""
  },
  {
    "store": "108",
    "failed_criteria": [
      "Submission photo unreviewable for assessing standard compliance"
    ],
    "action_plan": [
      "Retake photo for D8: Security Office / DVR Area: Ensure image is clear, well-lit, correctly framed, and accurately shows the required DVR equipment and surrounding area as per policy guidelines."
    ],
    "visual_feedback": [],
    "notes": "Incorrect photo submitted for D8: Security Office / DVR Area; expected view of DVR, received networking equipment. ACTION: Escalate for human review due to low confidence."
  },
  {
    "store": "109",
    "failed_criteria": [
      "No non-essential items (e.g. personal clutter, loose papers, cleaning supplies) placed on or immediately covering the DVR.",
      "DVR vents and heat sinks must be unobstructed—allow at least a few inches of clearance around all exposed sides (top and side panels); bottom surface contact with the resting surface is acceptable.",
      "DVR and associated cables must remain accessible for maintenance (not buried under items).",
      "Area should be free of excessive dust piles or debris that could interfere with equipment. Light dust accumulation is acceptable as long as it does not impair operation."
    ],
    "action_plan": [
      "Remove all non-essential items (e.g., pizza box) from on and around the DVR.",
      "Ensure at least a few inches of clearance on the top and sides of the DVR for proper ventilation; do not stack or cover the unit.",
      "Organize and reroute cables so the DVR and its connections remain fully accessible for maintenance.",
      "Clear away clutter and debris around the DVR area and perform a light cleaning to eliminate excessive dust piles."
    ],
    "visual_feedback": [
      "Pizza box covering the right side of the DVR, blocking the surface and vents.",
      "Cables piled beneath and behind the DVR limiting side clearance.",
      "Clutter and debris (boxes and papers) surrounding the unit, hindering access."
    ],
    "notes": ""
  },
  {
    "store": "110",
    "failed_criteria": [
      "No non-essential items (e.g. personal clutter, loose papers, cleaning supplies) placed on or immediately covering the DVR.",
      "DVR vents and heat sinks must be unobstructed—allow at least a few inches of clearance around all exposed sides (top and side panels); bottom surface contact with the resting surface is acceptable."
    ],
    "action_plan": [
      "Remove any non-essential items (such as the black pipe) from on and around the DVR to ensure it is not covered.",
      "Reposition or remove obstructions to provide at least a few inches of clearance around all exposed sides of the DVR vents and heat sinks."
    ],
    "visual_feedback": [
      "A large black pipe is resting directly on top of the DVR, covering the device.",
      "The pipe blocks the DVR's top panel vents, preventing the required clearance around exposed sides."
    ],
    "notes": ""
  }
]