[
  {
    "store": "022",
    "failed_criteria": [
      "Major removable object placed on DVR blocking all top vents"
    ],
    "action_plan": [
      "Remove the removable device from on top of the DVR or relocate it so that the DVR's top vents are fully unobstructed, ensuring proper heat dissipation."
    ],
    "visual_feedback": [
      "AverMedia device stacked directly on top of the Hikvision DVR, covering the top vents."
    ],
    "notes": ""
  },
  {
    "store": "049",
    "failed_criteria": [
      "DVR placement: DVR must be visible in the photo."
    ],
    "action_plan": [
      "Retake photo to clearly show the DVR in the submission area, ensuring it is unobstructed and visible."
    ],
    "visual_feedback": [
      "No identifiable DVR unit visible; only networking equipment and UPS are shown."
    ],
    "notes": ""
  },
  {
    "store": "055",
    "failed_criteria": [
      "DVR must be visible in the photo. If the device is completely obstructed or the photo is of the wrong area, fail."
    ],
    "action_plan": [
      "Retake and resubmit the photo ensuring the DVR device is clearly visible, unobstructed, and correctly framed in the submission."
    ],
    "visual_feedback": [
      "No DVR device detected; the submission shows only networking equipment without the DVR visible."
    ],
    "notes": ""
  },
  {
    "store": "064",
    "failed_criteria": [
      "DVR must be visible in the photo. If the device is completely obstructed or the photo is of the wrong area, fail."
    ],
    "action_plan": [
      "Retake photo showing the DVR clearly in the frame, ensuring it is not obstructed and captures its placement in the security office/DVR area."
    ],
    "visual_feedback": [
      "The submission photo appears to show network equipment and patch panels but no identifiable DVR device; the DVR is not visible."
    ],
    "notes": ""
  },
  {
    "store": "089",
    "failed_criteria": [
      "A major, removable object (UPS) is placed directly on the DVR, fully blocking top vents",
      "DVR vents and heat sinks are not unobstructed"
    ],
    "action_plan": [
      "Remove the UPS from the top of the DVR to ensure no removable objects block vents",
      "Ensure all DVR vents (top and sides) remain unobstructed by storing removable items elsewhere"
    ],
    "visual_feedback": [
      "UPS unit sits directly atop the DVR, covering the entire top surface vents",
      "No visible gap around DVR vents; top vents are completely smothered by the UPS"
    ],
    "notes": ""
  },
  {
    "store": "101",
    "failed_criteria": [
      "DVR must be visible in the photo."
    ],
    "action_plan": [
      "Retake the photo ensuring the DVR device is fully visible and unobstructed by boxes or other objects."
    ],
    "visual_feedback": [
      "The DVR device is fully concealed behind stacked boxes on both sides; no part of the DVR is visible."
    ],
    "notes": ""
  }
]