[
  {
    "store": "002",
    "failed_criteria": [
      "Ladder must not block any primary walkway or emergency exit"
    ],
    "action_plan": [
      "Reposition ladder away from the door to ensure it does not block any primary walkway or emergency exit."
    ],
    "visual_feedback": [
      "Ladder is placed directly in front of the exit door, blocking the egress path."
    ],
    "notes": ""
  },
  {
    "store": "014",
    "failed_criteria": [
      "Ladder must not block any primary walkway or emergency exit."
    ],
    "action_plan": [
      "Reposition ladder to ensure it does not block any primary walkway or emergency exit, placing it out of the path of doors and hallways."
    ],
    "visual_feedback": [
      "Ladder is positioned directly in front of a door handle, blocking access."
    ],
    "notes": ""
  },
  {
    "store": "019",
    "failed_criteria": [
      "It must NOT rest against or lean on electrical panels, wiring bundles, meter boxes, or other hazardous equipment."
    ],
    "action_plan": [
      "Relocate the ladder so it is not in contact with electrical panels or other hazardous equipment; place it on a stable shelf, rack, or against a solid surface away from electrical installations."
    ],
    "visual_feedback": [
      "Ladder is lying horizontally in direct contact with the electrical panels at the bottom of the image."
    ],
    "notes": ""
  },
  {
    "store": "024",
    "failed_criteria": [
      "It must NOT rest against or lean on electrical panels, wiring bundles, meter boxes, or other hazardous equipment."
    ],
    "action_plan": [
      "Reposition the ladder so it does not lean against or touch electrical panels or other hazardous equipment; lean it securely against a solid, non‐hazardous surface."
    ],
    "visual_feedback": [
      "The right ladder is in direct contact with the electrical panel on the right side of the image."
    ],
    "notes": ""
  },
  {
    "store": "031",
    "failed_criteria": [
      "Ladder must not block any primary walkway or emergency exit. Only fail if it is directly in front of a door, main path, or the only way through."
    ],
    "action_plan": [
      "Move ladder away from the door to ensure it does not block any primary walkway or entry point."
    ],
    "visual_feedback": [
      "Ladder is positioned directly in front of a door, obstructing access."
    ],
    "notes": ""
  },
  {
    "store": "050",
    "failed_criteria": [
      "Ladder must not block any primary walkway or emergency exit."
    ],
    "action_plan": [
      "Reposition the ladder so it does not block any primary walkway or emergency exit, ensuring clear and unobstructed access."
    ],
    "visual_feedback": [
      "The ladder on the right is positioned directly in front of the exit door, blocking access."
    ],
    "notes": ""
  },
  {
    "store": "052",
    "failed_criteria": [
      "Ladder must not rest against or lean on electrical panels, wiring bundles, meter boxes, or other hazardous equipment."
    ],
    "action_plan": [
      "Relocate the ladder so it is not in direct contact with electrical panels or hazardous equipment. Place it on a stable surface or against a wall."
    ],
    "visual_feedback": [
      "Bottom section of the ladder is resting on metal electrical panels."
    ],
    "notes": ""
  },
  {
    "store": "055",
    "failed_criteria": [
      "Obstruction & hazard check: Ladder must not block any primary walkway or emergency exit.",
      "Ladder placement: Ladder is resting on a door and appears unstable."
    ],
    "action_plan": [
      "Reposition the ladder so it does not block any doors or walkways; store horizontally on a secure rack or vertically against a wall out of the path.",
      "Ensure ladder rests on a stable surface; use a proper ladder rack or lean against a solid wall to prevent slipping."
    ],
    "visual_feedback": [
      "The ladder is placed horizontally across the garage door, blocking the exit.",
      "The ladder is resting on the door surface rather than a stable support, making it prone to sliding or falling."
    ],
    "notes": ""
  },
  {
    "store": "064",
    "failed_criteria": [
      "Submission photo unreviewable for assessing standard compliance"
    ],
    "action_plan": [
      "Retake photo for D9: Ladder Storage & Safety: Ensure image is clear, well-lit, correctly framed, and accurately shows the required area/details as per policy guidelines."
    ],
    "visual_feedback": [],
    "notes": "Submission photo is too blurry to assess standard compliance. ACTION: Escalate for human review due to low confidence."
  },
  {
    "store": "087",
    "failed_criteria": [
      "Ladder rests in direct contact with hazardous equipment (pipes/valve assembly)"
    ],
    "action_plan": [
      "Relocate ladder to rest on a stable, non-hazardous surface, ensuring it does not touch or lean on any pipes, meters, or other hazardous equipment."
    ],
    "visual_feedback": [
      "Ladder is directly resting on the pipe and valve assembly in the center of the image."
    ],
    "notes": ""
  },
  {
    "store": "092",
    "failed_criteria": [
      "Ladder must NOT rest against or lean on electrical panels, wiring bundles, meter boxes, or other hazardous equipment."
    ],
    "action_plan": [
      "Reposition the ladder so it does not lean against electrical panels or other hazardous equipment; place it against a stable, non-hazardous surface."
    ],
    "visual_feedback": [
      "The top section of the ladder is in direct contact with the electrical panel door mounted on the wall."
    ],
    "notes": ""
  },
  {
    "store": "110",
    "failed_criteria": [
      "Ladder must not rest against or lean on electrical panels, wiring bundles, meter boxes, or other hazardous equipment."
    ],
    "action_plan": [
      "Reposition the ladder so it does not touch or lean on electrical panels or other hazardous equipment; store it on an appropriate rack or bracket away from electrical panels."
    ],
    "visual_feedback": [
      "The ladder is in direct contact with the electrical panels visible on the wall (center and lower right of the image)."
    ],
    "notes": ""
  }
]