[
  {
    "store": "004",
    "failed_criteria": [
      "Sign-offs are present for the majority of required dates"
    ],
    "action_plan": [
      "Fill in initials for all daily tasks on each required date up to the photo date (2025-05-27) so that the majority of required dates have sign-offs, then retake and submit the photo showing completed entries."
    ],
    "visual_feedback": [
      "Missing initials in the sign-off columns for Monday (05/26) and Tuesday (05/27) for most tasks; only the 'Empty ALL garbage and replace bag' row has signatures."
    ],
    "notes": ""
  },
  {
    "store": "022",
    "failed_criteria": [
      "Sign-offs are present for the majority of required dates"
    ],
    "action_plan": [
      "Ensure the cleaning log is signed for all required dates up to and including the photo timestamp date (2025-06-07)."
    ],
    "visual_feedback": [
      "The log sheet on the bulletin board shows blank sign-off fields with no initials for dates up to the photo date."
    ],
    "notes": ""
  },
  {
    "store": "033",
    "failed_criteria": [
      "Sign-offs are present for the majority of required dates"
    ],
    "action_plan": [
      "Ensure the cleaning log has sign-offs for the majority of required dates up to the photo date."
    ],
    "visual_feedback": [
      "Monday, Tuesday, and Friday columns are blank with no sign-offs visible."
    ],
    "notes": ""
  },
  {
    "store": "043",
    "failed_criteria": [
      "Sign-offs are present for the majority of required dates"
    ],
    "action_plan": [
      "Complete sign-offs for the missing weekdays up to 2025-05-16 on the cleaning log"
    ],
    "visual_feedback": [
      "Most weekday sign-off columns up to the date 2025-05-16 are blank, indicating missing multiple days of sign-offs."
    ],
    "notes": ""
  },
  {
    "store": "049",
    "failed_criteria": [
      "Sign-offs are present for the majority of required dates"
    ],
    "action_plan": [
      "Ensure the cleaning log is signed off for the majority of required dates up to the photo timestamp (2025-05-29)."
    ],
    "visual_feedback": [
      "No sign-off entries visible in the date columns for the current week up to the photo date."
    ],
    "notes": ""
  },
  {
    "store": "084",
    "failed_criteria": [
      "Sign-offs are present for the majority of required dates"
    ],
    "action_plan": [
      "Ensure sign-offs are completed for all weekdays up to the photo date (Mon–Thu) before taking a new audit photo"
    ],
    "visual_feedback": [
      "Tuesday, Wednesday, and Thursday columns show 'NP' or blank entries indicating missing signatures"
    ],
    "notes": ""
  }
]